#!/Users/georgialexandrov/.nvm/versions/node/v12.14.0/bin/node

const { exec } = require('child_process');

const query = (query) => new Promise((res, rej) =>
  exec(`sqlite3 ./db/all.db "${query}"`, (error, stdout, stderr) => {
    if (error) rej(error)

    res(stdout)
  }));


const mayorMunicipalityQuery = (election_id, municipality_id, round) => `
  select
    candidates.party_ballot,
    candidates.candidate_name,
    sum(votes.valid_votes) as valid_votes
  from candidates
  join votes on votes.ballot_number = candidates.party_ballot and votes.election_id = ${election_id} and votes.round=${round}
  join protocols on protocols.section_id = votes.section_id and protocols.election_id = ${election_id} and protocols.round=${round}
  join sections on sections.id = protocols.section_id and sections.location_id in (select id from locations where municipality_id = ${municipality_id})
  where candidates.election_id = ${election_id} and candidates.location_id in (select id from locations where municipality_id = ${municipality_id})
  group by party_id
  order by valid_votes desc
`

query(mayorMunicipalityQuery(1, 1526, 1)).then((res) => {
  const expected = [
    '68|Йорданка Асенова Фандъкова|161909',
    '75|Мая Божидарова Манолова-Найденова|123714',
    '66|Борислав Александров Игнатов|54330',
    '70|Борис Бориславов Бонев|47936',
    '34|Ангел Чавдаров Джамбазки|17377',
    '4|Волен Николов Сидеров|6396',
    '47|ДЕСИСЛАВА ПЕТРОВА ИВАНЧЕВА|3627',
    '26|Минчо Христов Куминев|2940',
    '42|Тончо Ненков Токмакчиев|2763',
    '48|Николай Георгиев Дренчев|2711',
    '20|Тодор Иванов Славков|2527',
    '51|Пламен Трифонов Христов|1643',
    '10|Георги Стоянов Кадиев|1369',
    '27|Валери Методиев Григоров|1331',
    '69|СТЕФАН ТИТКОВ ИВАНОВ|1205',
    '1|Диана Ангелова Димитрова|879',
    '83|Радослав Стоилов Каратанчев|873',
    '18|Георги Венелинов Георгиев|471',
    '11|Петър Николаев Клисаров|454',
    '40|Младен Александров Младенов|428', '']

  console.log('Избори за кмет на община 2019 I ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})


query(mayorMunicipalityQuery(1, 1526, 2)).then((res) => {
  const expected = [
    '68|Йорданка Асенова Фандъкова|209542',
    '75|Мая Божидарова Манолова-Найденова|189176', '']

  console.log('Избори за кмет на община 2019 II ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})

query(mayorMunicipalityQuery(8, 1526, 1)).then((res) => {
  const expected = [
    '15|Йорданка Асенова Фандъкова|238500',
    '27|Вили Младенов Лилков|38113',
    '39|Михаил Стоянов Мирчев|33281',
    '7|Георги Стоянов Кадиев|23467',
    '12|Ангел Чавдаров Джамбазки|19337',
    '14|Явор Божилов Нотев|11116',
    '10|Иван Велков Велков|5657',
    '41|Минчо Христов Куминев|4007',
    '37|Силвия Чавдарова Трендафилова|4006',
    '6|Андрей Любомиров Георгиев|3675',
    '3|Страхил Чавдаров Ангелов|3364',
    '35|Виктор Стефанов Лилов|2630',
    '9|МАРИЯ ОЛЕВА КАЛЕНДЕРСКА|2008',
    '22|ХРИСТО ДИМОВ ДИМОВ|1369',
    '19|СТЕФАН ТИТКОВ ИВАНОВ|1359',
    '5|Иван Кирилов Лозанов|1005',
    '13|Желяз Андреев Турлаков|1012',
    '34|Альоша Аврамов Аврамов|985',
    '29|Петко Тодоров Тодоров)|716',
    '4|Владимир Светославов Марков|390',
    '24|Николай Петров Гацев|380', '']

  console.log('Избори за кмет на община 2015 I ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})



const presidentQuery = (election_id, round) => `
  select
    candidates.party_id,
    candidates.candidate_name,
    sum(votes.valid_votes) as valid_votes
  from votes
  join protocols on protocols.section_id = votes.section_id and protocols.election_id = ${election_id} and protocols.round=${round}
  join sections on sections.id = protocols.section_id
  join candidates on candidates.party_id=votes.ballot_number and candidates.election_id=${election_id}
  where votes.election_id=${election_id} and votes.round=${round}
  group by votes.ballot_number
  order by valid_votes desc;
`

query(presidentQuery(20, 1)).then((res) => {
  const expected = [
    '13|Румен Георгиев Радев и Илияна Малинова Йотова|973754',
    '17|Цецка Цачева Данговска и Пламен Иванов Манушев|840635',
    '19|Красимир Дончев Каракачанов и Явор Божилов Нотев|573016',
    '2|Веселин Найденов Марешки и Петър Живков Петров|427660',
    '4|Пламен Василев Орешарски и Данаил Стоянов Папазов|253726',
    '7|Трайчо Димитров Трайков и Съби Иванов Събев|224734',
    '15|Ивайло Георгиев Калфин и Любомир Тодоров Халачев|125531',
    '12|Татяна Дончева Тотева и Минчо Викторов Спасов|69372',
    '5|Жорж Ганчев Ганчев и Кольо Петков Парамов|27928',
    '3|Велизар Пенков Енчев и Биляна Дикова Велева-Грънчарова|18213',
    '22|Димитър Василев Маринов и Радослав Петров Петров|14974',
    '18|Румен Гълъбинов Гълъбинов и Веска Атанасова Волева|10286',
    '21|Пламен Панайотов Пасков и Светозар Стоянов Съев|10103',
    '10|Александър Трифонов Томов и Радослав Йорданов Радославов|9513',
    '14|Господин Тончев Тонев и Андрей Аврамов Андреев|6855',
    '20|Кемил Ахмед Рамадан и Момчил Добрев Добрев|6089',
    '6|Диана Гервасова Димитрова и Габриел Георгиев Герасимов|4362',
    '23|Николай Йорданов Банев и Сали Шабан Ибрям|4196',
    '11|Йорданка Радиева Колева и Веселин Димитров Христов|4182',
    '16|Камен Славянов Попов и Георги Стефанов Неделчев|5212',
    '8|Бисер Георгиев Миланов и Красимир Петров Настев|3215', '']

  console.log('Избори за президент 2016 I ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})


query(presidentQuery(20, 2)).then((res) => {
  const expected = [
    '13|Румен Георгиев Радев и Илияна Малинова Йотова|14279038',
    '17|Цецка Цачева Данговска и Пламен Иванов Манушев|8634176', '']

  console.log('Избори за президент 2016 II ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})


query(presidentQuery(22, 1)).then((res) => {
  const expected = [
    '2|Росен Асенов Плевнелиев и Маргарита Стефанова Попова|1349380',
    '8|Ивайло Георгиев Калфин и Стефан Ламбов Данаилов|974300',
    '1|Меглена Щилиянова Кунева и Любомир Христов Христов|470808',
    '9|Волен Николов Сидеров и Павел Димитров Шопов|122466',
    '6|Стефан Георгиев Солаков и Галина Асенова Василева|84205',
    '14|Атанас Марков Семов и Поля Николова Станчева|61797',
    '4|Румен Димитров Христов и Емануил Николов Йорданов|65761',
    '20|Светослав Емилов Витков и Венцислав Емилов Мицов|54125',
    '3|Сали Шабан Ибрям и Валентина Иванова Гоцева|41837',
    '12|Алексей Илиев Петров и Николай Личков Георгиев|31613',
    '17|Красимир Дончев Каракачанов и Даниела Проданова Симидчиева - Димитрова|33236',
    '5|Мария Василева Капон и Николай Христов Кисьов|30665',
    '13|Николай Нанков Ненчев и Жеко Стоянов Иванов|9827',
    '15|Павел Михайлов Чернев и Анелия Димитрова Делчева|8081',
    '16|Димитър Демиров Куцаров и Камелия Кирилова Тодорова|6989',
    '21|Венцислав Йорданов Йосифов и Емилиян Крумов Димитров|7021',
    '18|Андрей Иванов Чорбанов и Ангел Бойчев Мирчев|6340',
    '19|Николай Кирилов Василев и Владимир Емил Савов|5633', '']

  console.log('Избори за президент 2011 I ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})

query(presidentQuery(22, 2)).then((res) => {
  const expected = [
    '2|Росен Асенов Плевнелиев и Маргарита Стефанова Попова|1698136',
    '8|Ивайло Георгиев Калфин и Стефан Ламбов Данаилов|1531193', '']

  console.log('Избори за президент 2011 II ТУР:', res.split("\n").map((actual, i) => actual == expected[i]).reduce((agg, curr) => agg && curr, true))
})




console.log('Избори за членове на европейския парламент 2019', 'N/A')

console.log('Избори за кмет на кметство 2019 I ТУР', 'N/A')
console.log('Избори за кмет на кметство 2019 II ТУР', 'N/A')
console.log('Избори за кмет на район 2019 I ТУР', 'N/A')
console.log('Избори за кмет на район 2019 II ТУР', 'N/A')
console.log('Избори за общински съветници 2019', 'N/A')

console.log('Парламентарни избори 2017', 'N/A')

console.log('Избори за кмет на кметство 2015 I ТУР', 'N/A')
console.log('Избори за кмет на кметство 2015 II ТУР', 'N/A')
console.log('Избори за кмет на район 2015 I ТУР', 'N/A')
console.log('Избори за кмет на район 2015 II ТУР', 'N/A')
console.log('Избори за общински съветници 2015', 'N/A')

console.log('Парламентарни избори 2014', 'N/A')
console.log('Избори за членове на европейския парламент 2014', 'N/A')

console.log('Парламентарни избори 2013', 'N/A')

console.log('Избори за кмет на община 2011 I ТУР', 'N/A')
console.log('Избори за кмет на община 2011 II ТУР', 'N/A')
console.log('Избори за кмет на кметство 2011 I ТУР', 'N/A')
console.log('Избори за кмет на кметство 2011 II ТУР', 'N/A')
console.log('Избори за общински съветници 2011', 'N/A')
console.log('Избори за президент 2011 I ТУР:', 'N/A')
console.log('Избори за президент 2011 II ТУР:', 'N/A')

console.log('Парламентарни избори 2009', 'N/A')
console.log('Избори за членове на европейския парламент 2009', 'N/A')