const transform = require('stream-transform');
const parallel = 5;

function parse_vote_row(row) {
    const votes_row = {
        section_code: row.shift(),                     // 1) Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
        location: row.shift(),                         // 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
        parties: {}
    }

    while (row.length) {
        // Следват гласовете за всяка партия, коалиция от партии, инициативен комитет,
        // според съответната номенклатура, като данните са в последователност
        // № П/КП/ИК;действителни гласове;недействителни гласове
        party_id = row.shift()                         // Номер на партия
        valid = row.shift()                            // Брой действителни гласове
        invalid = row.shift()                          // Брой недействителни гласове

        votes_row.parties[party_id] = { valid, invalid}
    }
    // console.log(votes_row)
    return votes_row
}

module.exports = {
    candidate: transform((record, callback) => callback(null, 
        {
            ballot_number: record[0],                  // 1) Номер на партия/коалиция/инициативен комитет
            party_name: record[1],                     // 2) Име на партия/коалиция/инициативен комитет
            candidate_number: record[2],               // 3) Номер на кандидат в листата
            candidate_name: record[3],                 // 4) Име на кандидат
            candidate_is_chosen: record[4] == 1,       // 5) Флаг за избран кандидат
        }
    ), { parallel }),

    
    cik_parties: transform((record, callback) => callback(null,
        {
            number: record[0],                         // 1) Име
            name: record[1],                           // 2) Номер
        }
    ), { parallel }),

    sections: transform((record, callback) => callback(null, 
        {
            section_code: record[0],                   // 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
            section_local_id: record[1],               // 2) Идентификатор на административна единица, за която се гласува в секцията
            district: record[2],                       // 3) Име на административна единица, за която се гласува в секцията
            ekatte: record[3],                         // 4) ЕКАТТЕ на населеното място
            location: record[4],                       // 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
            mobile: record[5] == 1,                    // 6) Флаг мобилна секция
            ship: record[6] == 1,                      // 7) Флаг корабна секция
            machine: record[7] == 1,                   // 8) Флаг машинно гласуване
        }
    ), { parallel }),

    preferences: transform((record, callback) => callback(null,
        {
            section_code: record[0],                   // 1) Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
            party_id: record[1],                       // 2) Номер на партия
            candidate_id: record[2],                   // 3) Номер на кандидат в кандидатска листа
            preferences: record[3],                    // 4) Брой предпочитания (преференции)
        }
    ), { parallel }),

    protocols: transform((record, callback) => callback(null, {
        form_number: record[0],                        //   1)      № формуляр
        section_code: record[1],                       //   2)      Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
        location: record[2],                           //   3)      Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
        protocol_serial_numbers: record[3].split('|'), //   4)      Серийни номера на листите на протокола, разделени с "|"
        total_ballots_count: record[4],                //   5) А.   Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 от ИК
        total_voters_count: record[5],                 //   6) 1.   Брой на избирателите според част І и част ІІ на избирателния списък при предаването му на СИК
        added_voters_count: record[6],                 //   7) 2.   Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък (част І и част ІІ) в изборния ден
        voters_count_by_signature: record[7],          //   8) 3.   Брой на гласувалите избиратели според положените подписи в избирателния списък (част І и част ІІ), включително и подписите в допълнителната страница/и (под чертата)
        voters_on_paper_count: record[8],              //   9) 3.а) Брой избиратели, гласували с хартиена бюлетина
        total_voters_count_machine: record[9],                 //  10) 3.б) Брой на потвърдените гласове от машинното гласуване (Общ брой гласували за формуляр 14)
        unused_ballots: record[10],                    //  11) 4.а) брой на неизползваните бюлетини
        destroyed_ballots: record[11],                 //  12) 4.б) брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
        invalid_ballots_indian_record: record[12],     //  13) 4.в) брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
        invalid_ballots_photo: record[13],             //  14) 4.г) брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
        invalid_ballots_public: record[14],            //  15) 4.д) брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
        invalid_ballot_mistake: record[15],            //  16) 4.е) брой на сгрешените бюлетини
        total_ballots_in_box: record[16],              //  17) 5.   Брой на намерените в избирателната кутия бюлетини
        total_ballots_in_box: record[17],              //  18) 5.а) Брой на намерените в избирателната кутия бюлетини
        total_votes_by_machine: record[18],            //  19) 5.б) Брой на потвърдените гласове от машинното гласуване
        total_invalid_ballots_machine_vote: record[19],//  20) 6.   Брой намерени в избирателната кутия недействителни гласове (бюлетини)
        total_invalid_ballots: record[20],             //  21) 7.   Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
        total_valid_ballots: record[21],               //  22) 7.1  брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети 
        total_valid_ballots_23: record[22],            //  23) 7.1а брой на намерените в избирателната кутия действителни гласове (бюлетини), подадени за кандидатските листи на партии, коалиции и инициативни комитети (Б)
        total_valid_ballots_machine: record[23],       //  24) 7.1б брой действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети от машинното гласуване (МГ)
        total_valid_no_one_all: record[24],            //  25) 7.2  брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
        total_valid_no_one_paper: record[25],          //  26) 7.2а брой на намерените в избирателната кутия действителни гласове (бюлетини) с отбелязване „Не подкрепям никого“ (Б)
        total_valid_no_one_machine: record[26],        //  27) 7.2б брой действителните гласове с отбелязване „Не подкрепям никого“ от машинното гласуване (МГ)
        invalid_unclear: record[27],                   //  28) 9.   Бюлетини, в които не е отбелязан вотът на избирателя (празни бюлетини), бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
    }), { parallel }),

    votes: transform((record, callback) => callback(null, parse_vote_row(record)), { parallel }),
}