create table _2011_mayor_1_candidates(
  "district_id" text,      -- 1) Код на ОИК
  "ekatte" integer,        -- 2) ЕКАТТЕ на кметство
  "location_name" text,    -- 2) ЕКАТТЕ на кметство3) Име на кметство
  "candidate_id" integer,  -- 4) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_name" text    -- 3) Име на кандидата
);

create table _2011_mayor_municipality_1_candidates(
  "district_id" text,   -- 1) Код на ОИК
  "party_id" integer,   -- 2) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_name" text -- 3) Име на кандидата
);

create table _2011_council_region_1_candidates(
  "district_id" text,   -- 1) Код на ОИК
  "party_id" integer,   -- 2) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_id" text,  -- 3) Номер на кандидата в кандидатската листа
  "candidate_name" text -- 4) Име на кандидата
);

create table _2011_mayor_2_candidates(
  "district_id" text,   -- 1) Код на ОИК
  "ekatte" text,        -- 2) ЕКАТТЕ на кметство
  "location_name" text, -- 3) Име на кметство
  "party_id" integer,   -- 4) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_name" text -- 5) Име на кандидата
);

create table _2011_mayor_municipality_2_candidates(
  "district_id" text,      -- 1) Код на ОИК
  "candidate_id" integer,  -- 2) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_name" text    -- 3) Име на кандидата
);


create table _2011_mayor_1_coalitions(
  "district_id" text,            -- 1) Код на ОИК
  "candidate_id" integer,        -- 2) Номер на партията/коалицията/инициативния комитет
  "candidate_name" text,         -- 3) Наименование на партията/коалицията/инициативния комитет
  "coalition_member_1" integer,  -- номер на партията участваща в коалиция
  "coalition_member_2" integer,  -- номер на партията участваща в коалиция
  "coalition_member_3" integer,  -- номер на партията участваща в коалиция
  "coalition_member_4" integer,  -- номер на партията участваща в коалиция
  "coalition_member_5" integer,  -- номер на партията участваща в коалиция
  "coalition_member_6" integer,  -- номер на партията участваща в коалиция
  "coalition_member_7" integer,  -- номер на партията участваща в коалиция
  "coalition_member_8" integer,  -- номер на партията участваща в коалиция
  "coalition_member_9" integer,  -- номер на партията участваща в коалиция
  "coalition_member_10" integer, -- номер на партията участваща в коалиция
  "coalition_member_11" integer  -- номер на партията участваща в коалиция
);
create table _2011_mayor_municipality_1_coalitions(
  "district_id" text,            -- 1) Код на ОИК
  "candidate_id" integer,        -- 2) Номер на партията/коалицията/инициативния комитет
  "candidate_name" text,         -- 3) Наименование на партията/коалицията/инициативния комитет
  "coalition_member_1" integer,  -- номер на партията участваща в коалиция
  "coalition_member_2" integer,  -- номер на партията участваща в коалиция
  "coalition_member_3" integer,  -- номер на партията участваща в коалиция
  "coalition_member_4" integer,  -- номер на партията участваща в коалиция
  "coalition_member_5" integer,  -- номер на партията участваща в коалиция
  "coalition_member_6" integer,  -- номер на партията участваща в коалиция
  "coalition_member_7" integer,  -- номер на партията участваща в коалиция
  "coalition_member_8" integer,  -- номер на партията участваща в коалиция
  "coalition_member_9" integer,  -- номер на партията участваща в коалиция
  "coalition_member_10" integer, -- номер на партията участваща в коалиция
  "coalition_member_11" integer  -- номер на партията участваща в коалиция
);
create table _2011_council_region_1_coalitions(
  "district_id" text,            -- 1) Код на ОИК
  "candidate_id" integer,        -- 2) Номер на партията/коалицията/инициативния комитет
  "candidate_name" text,         -- 3) Наименование на партията/коалицията/инициативния комитет
  "coalition_member_1" integer,  -- номер на партията участваща в коалиция
  "coalition_member_2" integer,  -- номер на партията участваща в коалиция
  "coalition_member_3" integer,  -- номер на партията участваща в коалиция
  "coalition_member_4" integer,  -- номер на партията участваща в коалиция
  "coalition_member_5" integer,  -- номер на партията участваща в коалиция
  "coalition_member_6" integer,  -- номер на партията участваща в коалиция
  "coalition_member_7" integer,  -- номер на партията участваща в коалиция
  "coalition_member_8" integer,  -- номер на партията участваща в коалиция
  "coalition_member_9" integer,  -- номер на партията участваща в коалиция
  "coalition_member_10" integer, -- номер на партията участваща в коалиция
  "coalition_member_11" integer, -- номер на партията участваща в коалиция
  "coalition_member_12" integer  -- номер на партията участваща в коалиция
);

create table _2011_mayor_2_coalitions(
  "district_id" text,            -- 1) Код на ОИК
  "candidate_id" integer,        -- 2) Номер на партията/коалицията/инициативния комитет
  "candidate_name" text,         -- 3) Наименование на партията/коалицията/инициативния комитет
  "coalition_member_1" integer,  -- номер на партията участваща в коалиция
  "coalition_member_2" integer,  -- номер на партията участваща в коалиция
  "coalition_member_3" integer,  -- номер на партията участваща в коалиция
  "coalition_member_4" integer,  -- номер на партията участваща в коалиция
  "coalition_member_5" integer,  -- номер на партията участваща в коалиция
  "coalition_member_6" integer,  -- номер на партията участваща в коалиция
  "coalition_member_7" integer,  -- номер на партията участваща в коалиция
  "coalition_member_8" integer,  -- номер на партията участваща в коалиция
  "coalition_member_9" integer,  -- номер на партията участваща в коалиция
  "coalition_member_10" integer, -- номер на партията участваща в коалиция
  "coalition_member_11" integer  -- номер на партията участваща в коалиция
);

create table _2011_mayor_municipality_2_coalitions(
  "district_id" text,            -- 1) Код на ОИК
  "candidate_id" integer,        -- 2) Номер на партията/коалицията/инициативния комитет
  "candidate_name" text,         -- 3) Наименование на партията/коалицията/инициативния комитет
  "coalition_member_1" integer,  -- номер на партията участваща в коалиция
  "coalition_member_2" integer,  -- номер на партията участваща в коалиция
  "coalition_member_3" integer,  -- номер на партията участваща в коалиция
  "coalition_member_4" integer,  -- номер на партията участваща в коалиция
  "coalition_member_5" integer,  -- номер на партията участваща в коалиция
  "coalition_member_6" integer,  -- номер на партията участваща в коалиция
  "coalition_member_7" integer,  -- номер на партията участваща в коалиция
  "coalition_member_8" integer,  -- номер на партията участваща в коалиция
  "coalition_member_10" integer, -- номер на партията участваща в коалиция
  "coalition_member_11" integer, -- номер на партията участваща в коалиция
  "coalition_member_9" integer   -- номер на партията участваща в коалиция
);

create table _2011_mayor_1_cik_parties(
  "party_id" integer, -- 1) Номер, под който е регистрирана в ЦИК партията/коалицията
  "party_name" text   -- 2) Наименование на партията/коалицията
);

create table _2011_mayor_municipality_1_cik_parties(
  "party_id" integer, -- 1) Номер, под който е регистрирана в ЦИК партията/коалицията
  "party_name" text   -- 2) Наименование на партията/коалицията
);

create table _2011_council_region_1_cik_parties(
  "party_id" integer, -- 1) Номер, под който е регистрирана в ЦИК партията/коалицията
  "party_name" text   -- 2) Наименование на партията/коалицията
);

create table _2011_mayor_2_cik_parties(
  "party_id" integer, -- 1) Номер, под който е регистрирана в ЦИК партията/коалицията
  "party_name" text   -- 2) Наименование на партията/коалицията
);

create table _2011_mayor_municipality_2_cik_parties(
  "party_id" integer, -- 1) Номер, под който е регистрирана в ЦИК партията/коалицията
  "party_name" text   -- 2) Наименование на партията/коалицията
);


create table _2011_mayor_1_protocols(
  "section_type" integer,                       -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                            -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       -- 3) С: Брой на избирателите според част І и част ІІ на избирателния списък при предаване му на СИК
                                                --    П: Брой на избирателите според списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой на секционните избирателни комисии в общината
  "added_on_elections_day" integer,             -- 4) С: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателния списък в изборния ден
                                                --    П: Брой на регистрираните кандидатски листи на партии, коалиции от партиии независими кандидати за кмет на община
                                                --    Е: Брой на секционните избирателни комисии в общината, представили протоколи за протичане на изборния ден
  "added_voters" integer,                       -- 5) С: Брой на избирателите в допълнителния избирателен списък
                                                --    П: Брой на гласувалите избиратели според положените подписи в списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой избирателни урни, предадени от СИК
  "number_of_candidates" integer,               -- 6) С: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за кмет на община
                                                --    П: Брой на недействителните бюлетини за кмет на общинапо чл. 180 от ИК (показване начина на гласуване)
                                                --    Е: Брой на избирателите според част І и част ІІ на избирателните списъци при предаването им на СИК (сумата от числата от т. 1 от протоколите на СИК)
  "voters_by_signature" integer,                -- 7) С: Брой на гласувалите избиратели според положените подписи в избирателния списък – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния списък
                                                --    Е: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателните списъци в изборния ден (сумата от числата от т. 2 от протоколите на СИК)
                                                --    П: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_ballots_public" integer,             -- 8) С: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (показване начина на гласуване)
                                                --    П: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожена с надпис «сгрешена» и подпечатана с печата на СИК
                                                --    Е: Брой на избирателите в допълнителните избирателни списъци (сумата от числата от т. 3 от протоколите на СИК)
  "invalid_ballots_photo" integer,              -- 9) С: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с техниески средства начина на гласуване)
                                                --    П: Брой на придружителите, вписани в графа "Забележки" на списъка (чл. 205, ал. 5, изр. 2 от ИК)
                                                --    Е: Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за кмет на община
  "invalid_mistake" integer,                    -- 10) С: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожени с надпис «сгрешена» и подпечатани с печата на СИК
                                                --     П: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 205, ал. 5, изр. 3 от ИК)
                                                --     Е: Брой на гласувалите избиратели според положените подписи в избирателните списъци – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителните списъци (сумата от числата от т. 5 от протоколите на СИК)

  "declarations_eye_problems" integer,          -- 11) С: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
                                                --     П: Брой на намерените в избирателната урна бюлетини за кмет на община
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (сумата от числата от т. 6.2 от протоколите на СИК)
  "assistants_count_1" integer,                 -- 12) С: Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
                                                --     П: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (сумата от числата от т. 7.2 от протоколите на СИК)
  "assistants_count_2" integer,                 -- 13) С: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
                                                --     П: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     Е: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК) (сумата от числата от т. 8.2 от протоколите на СИК)
  "ballots_in_box" integer,                     -- 14) С: Брой на намерените в избирателните урни бюлетини за кмет на община
                                                --     П: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     Е: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)  (сумата от числата от т. 9 от протоколите на СИК)
  "invalid_ballots" integer,                    -- 15) С: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     П: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     Е: Брой на придружителите, вписани в графа "Забележки" на избирателните списъци (по чл. 204, ал. 3, изр. 1 от ИК) (сумата от числата от т. 10 от протоколите на СИК)
  "invalid_ballots_special_characters" integer, -- 16) С: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     П: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой на придружителите от списъците за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 и чл. 205, ал. 5 изр. 3 от ИК) (сумата от числата от т. 11 от протоколите на СИК)
  "invalid_not_x" integer,                      -- 17) С: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     П: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т.16 и  т. 17)
                                                --     Е: Брой на намерените в избирателнните урни бюлетини за кмет на община
  "invalid_ballots_multiple_chouce" integer,    -- 18) С: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     П: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община, които не са по установения образец
  "invalid_ballots_no_stamps_count" integer,    -- 19) С: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
  "total_invalid_ballots" integer,              -- 20) С: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т. 16 и т. 17)
                                                --     Е: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "total_valid_ballots" integer,                -- 21) С: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака "Х" засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
  "e_invalid_ballots_no_stamps_count" integer,  -- 22) Е: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "e_total_invalid_ballots" integer,            -- 23) Е: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 16, т. 17, т. 18, т. 19, т. 20)
  "e_total_valid_ballots" integer               -- 24) Е: Брой на действителните гласове (бюлетини)за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
);
create table _2011_mayor_municipality_1_protocols(
  "section_type" integer,                       -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                            -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       -- 3) С: Брой на избирателите според част І и част ІІ на избирателния списък при предаване му на СИК
                                                --    П: Брой на избирателите според списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой на секционните избирателни комисии в общината
  "added_on_elections_day" integer,             -- 4) С: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателния списък в изборния ден
                                                --    П: Брой на регистрираните кандидатски листи на партии, коалиции от партиии независими кандидати за кмет на община
                                                --    Е: Брой на секционните избирателни комисии в общината, представили протоколи за протичане на изборния ден
  "added_voters" integer,                       -- 5) С: Брой на избирателите в допълнителния избирателен списък
                                                --    П: Брой на гласувалите избиратели според положените подписи в списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой избирателни урни, предадени от СИК
  "number_of_candidates" integer,               -- 6) С: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за кмет на община
                                                --    П: Брой на недействителните бюлетини за кмет на общинапо чл. 180 от ИК (показване начина на гласуване)
                                                --    Е: Брой на избирателите според част І и част ІІ на избирателните списъци при предаването им на СИК (сумата от числата от т. 1 от протоколите на СИК)
  "voters_by_signature" integer,                -- 7) С: Брой на гласувалите избиратели според положените подписи в избирателния списък – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния списък
                                                --    Е: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателните списъци в изборния ден (сумата от числата от т. 2 от протоколите на СИК)
                                                --    П: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_ballots_public" integer,             -- 8) С: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (показване начина на гласуване)
                                                --    П: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожена с надпис «сгрешена» и подпечатана с печата на СИК
                                                --    Е: Брой на избирателите в допълнителните избирателни списъци (сумата от числата от т. 3 от протоколите на СИК)
  "invalid_ballots_photo" integer,              -- 9) С: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с техниески средства начина на гласуване)
                                                --    П: Брой на придружителите, вписани в графа "Забележки" на списъка (чл. 205, ал. 5, изр. 2 от ИК)
                                                --    Е: Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за кмет на община
  "invalid_mistake" integer,                    -- 10) С: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожени с надпис «сгрешена» и подпечатани с печата на СИК
                                                --     П: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 205, ал. 5, изр. 3 от ИК)
                                                --     Е: Брой на гласувалите избиратели според положените подписи в избирателните списъци – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителните списъци (сумата от числата от т. 5 от протоколите на СИК)

  "declarations_eye_problems" integer,          -- 11) С: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
                                                --     П: Брой на намерените в избирателната урна бюлетини за кмет на община
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (сумата от числата от т. 6.2 от протоколите на СИК)
  "assistants_count_1" integer,                 -- 12) С: Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
                                                --     П: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (сумата от числата от т. 7.2 от протоколите на СИК)
  "assistants_count_2" integer,                 -- 13) С: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
                                                --     П: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     Е: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК) (сумата от числата от т. 8.2 от протоколите на СИК)
  "ballots_in_box" integer,                     -- 14) С: Брой на намерените в избирателните урни бюлетини за кмет на община
                                                --     П: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     Е: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)  (сумата от числата от т. 9 от протоколите на СИК)
  "invalid_ballots" integer,                    -- 15) С: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     П: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     Е: Брой на придружителите, вписани в графа "Забележки" на избирателните списъци (по чл. 204, ал. 3, изр. 1 от ИК) (сумата от числата от т. 10 от протоколите на СИК)
  "invalid_ballots_special_characters" integer, -- 16) С: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     П: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой на придружителите от списъците за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 и чл. 205, ал. 5 изр. 3 от ИК) (сумата от числата от т. 11 от протоколите на СИК)
  "invalid_not_x" integer,                      -- 17) С: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     П: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т.16 и  т. 17)
                                                --     Е: Брой на намерените в избирателнните урни бюлетини за кмет на община
  "invalid_ballots_multiple_chouce" integer,    -- 18) С: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     П: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община, които не са по установения образец
  "invalid_ballots_no_stamps_count" integer,    -- 19) С: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
  "total_invalid_ballots" integer,              -- 20) С: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т. 16 и т. 17)
                                                --     Е: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "total_valid_ballots" integer,                -- 21) С: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака "Х" засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
  "e_invalid_ballots_no_stamps_count" integer,  -- 22) Е: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "e_total_invalid_ballots" integer,            -- 23) Е: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 16, т. 17, т. 18, т. 19, т. 20)
  "e_total_valid_ballots" integer               -- 24) Е: Брой на действителните гласове (бюлетини)за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
);
create table _2011_council_region_1_protocols(
  "section_type" integer,                       -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                            -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       -- 3) С: Брой на избирателите според част І и част ІІ на избирателния списък при предаване му на СИК
                                                --    П: Брой на избирателите според списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой на секционните избирателни комисии в общината
  "added_on_elections_day" integer,             -- 4) С: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателния списък в изборния ден
                                                --    П: Брой на регистрираните кандидатски листи на партии, коалиции от партиии независими кандидати за кмет на община
                                                --    Е: Брой на секционните избирателни комисии в общината, представили протоколи за протичане на изборния ден
  "added_voters" integer,                       -- 5) С: Брой на избирателите в допълнителния избирателен списък
                                                --    П: Брой на гласувалите избиратели според положените подписи в списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой избирателни урни, предадени от СИК
  "number_of_candidates" integer,               -- 6) С: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за кмет на община
                                                --    П: Брой на недействителните бюлетини за кмет на общинапо чл. 180 от ИК (показване начина на гласуване)
                                                --    Е: Брой на избирателите според част І и част ІІ на избирателните списъци при предаването им на СИК (сумата от числата от т. 1 от протоколите на СИК)
  "voters_by_signature" integer,                -- 7) С: Брой на гласувалите избиратели според положените подписи в избирателния списък – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния списък
                                                --    Е: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателните списъци в изборния ден (сумата от числата от т. 2 от протоколите на СИК)
                                                --    П: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_ballots_public" integer,             -- 8) С: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (показване начина на гласуване)
                                                --    П: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожена с надпис «сгрешена» и подпечатана с печата на СИК
                                                --    Е: Брой на избирателите в допълнителните избирателни списъци (сумата от числата от т. 3 от протоколите на СИК)
  "invalid_ballots_photo" integer,              -- 9) С: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с техниески средства начина на гласуване)
                                                --    П: Брой на придружителите, вписани в графа "Забележки" на списъка (чл. 205, ал. 5, изр. 2 от ИК)
                                                --    Е: Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за кмет на община
  "invalid_mistake" integer,                    -- 10) С: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожени с надпис «сгрешена» и подпечатани с печата на СИК
                                                --     П: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 205, ал. 5, изр. 3 от ИК)
                                                --     Е: Брой на гласувалите избиратели според положените подписи в избирателните списъци – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителните списъци (сумата от числата от т. 5 от протоколите на СИК)

  "declarations_eye_problems" integer,          -- 11) С: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
                                                --     П: Брой на намерените в избирателната урна бюлетини за кмет на община
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (сумата от числата от т. 6.2 от протоколите на СИК)
  "assistants_count_1" integer,                 -- 12) С: Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
                                                --     П: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (сумата от числата от т. 7.2 от протоколите на СИК)
  "assistants_count_2" integer,                 -- 13) С: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
                                                --     П: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     Е: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК) (сумата от числата от т. 8.2 от протоколите на СИК)
  "ballots_in_box" integer,                     -- 14) С: Брой на намерените в избирателните урни бюлетини за кмет на община
                                                --     П: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     Е: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)  (сумата от числата от т. 9 от протоколите на СИК)
  "invalid_ballots" integer,                    -- 15) С: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     П: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     Е: Брой на придружителите, вписани в графа "Забележки" на избирателните списъци (по чл. 204, ал. 3, изр. 1 от ИК) (сумата от числата от т. 10 от протоколите на СИК)
  "invalid_ballots_special_characters" integer, -- 16) С: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     П: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой на придружителите от списъците за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 и чл. 205, ал. 5 изр. 3 от ИК) (сумата от числата от т. 11 от протоколите на СИК)
  "invalid_not_x" integer,                      -- 17) С: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     П: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т.16 и  т. 17)
                                                --     Е: Брой на намерените в избирателнните урни бюлетини за кмет на община
  "invalid_ballots_multiple_chouce" integer,    -- 18) С: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     П: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община, които не са по установения образец
  "invalid_ballots_no_stamps_count" integer,    -- 19) С: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
  "total_invalid_ballots" integer,              -- 20) С: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т. 16 и т. 17)
                                                --     Е: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "total_valid_ballots" integer,                -- 21) С: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака "Х" засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
  "e_invalid_ballots_no_stamps_count" integer,  -- 22) Е: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "e_total_invalid_ballots" integer,            -- 23) Е: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 16, т. 17, т. 18, т. 19, т. 20)
  "e_total_valid_ballots" integer               -- 24) Е: Брой на действителните гласове (бюлетини)за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
);
create table _2011_mayor_2_protocols(
  "section_type" integer,                       -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                            -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       -- 3) С: Брой на избирателите според част І и част ІІ на избирателния списък при предаване му на СИК
                                                --    П: Брой на избирателите според списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой на секционните избирателни комисии в общината
  "added_on_elections_day" integer,             -- 4) С: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателния списък в изборния ден
                                                --    П: Брой на регистрираните кандидатски листи на партии, коалиции от партиии независими кандидати за кмет на община
                                                --    Е: Брой на секционните избирателни комисии в общината, представили протоколи за протичане на изборния ден
  "added_voters" integer,                       -- 5) С: Брой на избирателите в допълнителния избирателен списък
                                                --    П: Брой на гласувалите избиратели според положените подписи в списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой избирателни урни, предадени от СИК
  "number_of_candidates" integer,               -- 6) С: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за кмет на община
                                                --    П: Брой на недействителните бюлетини за кмет на общинапо чл. 180 от ИК (показване начина на гласуване)
                                                --    Е: Брой на избирателите според част І и част ІІ на избирателните списъци при предаването им на СИК (сумата от числата от т. 1 от протоколите на СИК)
  "voters_by_signature" integer,                -- 7) С: Брой на гласувалите избиратели според положените подписи в избирателния списък – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния списък
                                                --    Е: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателните списъци в изборния ден (сумата от числата от т. 2 от протоколите на СИК)
                                                --    П: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_ballots_public" integer,             -- 8) С: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (показване начина на гласуване)
                                                --    П: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожена с надпис «сгрешена» и подпечатана с печата на СИК
                                                --    Е: Брой на избирателите в допълнителните избирателни списъци (сумата от числата от т. 3 от протоколите на СИК)
  "invalid_ballots_photo" integer,              -- 9) С: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с техниески средства начина на гласуване)
                                                --    П: Брой на придружителите, вписани в графа "Забележки" на списъка (чл. 205, ал. 5, изр. 2 от ИК)
                                                --    Е: Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за кмет на община
  "invalid_mistake" integer,                    -- 10) С: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожени с надпис «сгрешена» и подпечатани с печата на СИК
                                                --     П: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 205, ал. 5, изр. 3 от ИК)
                                                --     Е: Брой на гласувалите избиратели според положените подписи в избирателните списъци – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителните списъци (сумата от числата от т. 5 от протоколите на СИК)

  "declarations_eye_problems" integer,          -- 11) С: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
                                                --     П: Брой на намерените в избирателната урна бюлетини за кмет на община
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (сумата от числата от т. 6.2 от протоколите на СИК)
  "assistants_count_1" integer,                 -- 12) С: Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
                                                --     П: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (сумата от числата от т. 7.2 от протоколите на СИК)
  "assistants_count_2" integer,                 -- 13) С: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
                                                --     П: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     Е: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК) (сумата от числата от т. 8.2 от протоколите на СИК)
  "ballots_in_box" integer,                     -- 14) С: Брой на намерените в избирателните урни бюлетини за кмет на община
                                                --     П: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     Е: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)  (сумата от числата от т. 9 от протоколите на СИК)
  "invalid_ballots" integer,                    -- 15) С: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     П: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     Е: Брой на придружителите, вписани в графа "Забележки" на избирателните списъци (по чл. 204, ал. 3, изр. 1 от ИК) (сумата от числата от т. 10 от протоколите на СИК)
  "invalid_ballots_special_characters" integer, -- 16) С: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     П: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой на придружителите от списъците за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 и чл. 205, ал. 5 изр. 3 от ИК) (сумата от числата от т. 11 от протоколите на СИК)
  "invalid_not_x" integer,                      -- 17) С: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     П: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т.16 и  т. 17)
                                                --     Е: Брой на намерените в избирателнните урни бюлетини за кмет на община
  "invalid_ballots_multiple_chouce" integer,    -- 18) С: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     П: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община, които не са по установения образец
  "invalid_ballots_no_stamps_count" integer,    -- 19) С: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
  "total_invalid_ballots" integer,              -- 20) С: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т. 16 и т. 17)
                                                --     Е: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "total_valid_ballots" integer,                -- 21) С: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака "Х" засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
  "e_invalid_ballots_no_stamps_count" integer,  -- 22) Е: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "e_total_invalid_ballots" integer,            -- 23) Е: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 16, т. 17, т. 18, т. 19, т. 20)
  "e_total_valid_ballots" integer               -- 24) Е: Брой на действителните гласове (бюлетини)за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
);
create table _2011_mayor_municipality_2_protocols(
  "section_type" integer,                       -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                            -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       -- 3) С: Брой на избирателите според част І и част ІІ на избирателния списък при предаване му на СИК
                                                --    П: Брой на избирателите според списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой на секционните избирателни комисии в общината
  "added_on_elections_day" integer,             -- 4) С: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателния списък в изборния ден
                                                --    П: Брой на регистрираните кандидатски листи на партии, коалиции от партиии независими кандидати за кмет на община
                                                --    Е: Брой на секционните избирателни комисии в общината, представили протоколи за протичане на изборния ден
  "added_voters" integer,                       -- 5) С: Брой на избирателите в допълнителния избирателен списък
                                                --    П: Брой на гласувалите избиратели според положените подписи в списъка за гласуване с подвижна избирателна урна
                                                --    Е: Брой избирателни урни, предадени от СИК
  "number_of_candidates" integer,               -- 6) С: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за кмет на община
                                                --    П: Брой на недействителните бюлетини за кмет на общинапо чл. 180 от ИК (показване начина на гласуване)
                                                --    Е: Брой на избирателите според част І и част ІІ на избирателните списъци при предаването им на СИК (сумата от числата от т. 1 от протоколите на СИК)
  "voters_by_signature" integer,                -- 7) С: Брой на гласувалите избиратели според положените подписи в избирателния списък – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния списък
                                                --    Е: Брой на избирателите, вписани в допълнителната страница (под чертата) в части І и ІІ на избирателните списъци в изборния ден (сумата от числата от т. 2 от протоколите на СИК)
                                                --    П: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_ballots_public" integer,             -- 8) С: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (показване начина на гласуване)
                                                --    П: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожена с надпис «сгрешена» и подпечатана с печата на СИК
                                                --    Е: Брой на избирателите в допълнителните избирателни списъци (сумата от числата от т. 3 от протоколите на СИК)
  "invalid_ballots_photo" integer,              -- 9) С: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (заснемане с техниески средства начина на гласуване)
                                                --    П: Брой на придружителите, вписани в графа "Забележки" на списъка (чл. 205, ал. 5, изр. 2 от ИК)
                                                --    Е: Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за кмет на община
  "invalid_mistake" integer,                    -- 10) С: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК), унищожени с надпис «сгрешена» и подпечатани с печата на СИК
                                                --     П: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 205, ал. 5, изр. 3 от ИК)
                                                --     Е: Брой на гласувалите избиратели според положените подписи в избирателните списъци – части І и ІІ, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителните списъци (сумата от числата от т. 5 от протоколите на СИК)

  "declarations_eye_problems" integer,          -- 11) С: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
                                                --     П: Брой на намерените в избирателната урна бюлетини за кмет на община
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 180 от ИК (сумата от числата от т. 6.2 от протоколите на СИК)
  "assistants_count_1" integer,                 -- 12) С: Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
                                                --     П: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     Е: Брой на недействителните бюлетини за кмет на община по чл. 181 от ИК (сумата от числата от т. 7.2 от протоколите на СИК)
  "assistants_count_2" integer,                 -- 13) С: Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
                                                --     П: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     Е: Брой на сгрешените бюлетини за кмет на община (по чл. 201, ал. 2 от ИК) (сумата от числата от т. 8.2 от протоколите на СИК)
  "ballots_in_box" integer,                     -- 14) С: Брой на намерените в избирателните урни бюлетини за кмет на община
                                                --     П: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     Е: Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)  (сумата от числата от т. 9 от протоколите на СИК)
  "invalid_ballots" integer,                    -- 15) С: Брой бюлетини за кмет на община, които не са по установения образец
                                                --     П: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     Е: Брой на придружителите, вписани в графа "Забележки" на избирателните списъци (по чл. 204, ал. 3, изр. 1 от ИК) (сумата от числата от т. 10 от протоколите на СИК)
  "invalid_ballots_special_characters" integer, -- 16) С: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
                                                --     П: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой на придружителите от списъците за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 и чл. 205, ал. 5 изр. 3 от ИК) (сумата от числата от т. 11 от протоколите на СИК)
  "invalid_not_x" integer,                      -- 17) С: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
                                                --     П: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т.16 и  т. 17)
                                                --     Е: Брой на намерените в избирателнните урни бюлетини за кмет на община
  "invalid_ballots_multiple_chouce" integer,    -- 18) С: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака “Х” засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
                                                --     П: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община, които не са по установения образец
  "invalid_ballots_no_stamps_count" integer,    -- 19) С: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
                                                --     Е: Брой бюлетини за кмет на община с вписани в тях специални символи като букви, цифри или други знаци
  "total_invalid_ballots" integer,              -- 20) С: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 13, т. 14, т. 15, т. 16 и т. 17)
                                                --     Е: Брой бюлетини за кмет на община по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "total_valid_ballots" integer,                -- 21) С: Брой на действителните гласове (бюлетини) за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
                                                --     Е: Брой бюлетини за кмет на община по установения образец с отбелязан вот със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят, за две или повече кандидатски листи или знака "Х" засяга повече от едно квадратче за гласуване и не може да се определи еднозначно волята на избирателя
  "e_invalid_ballots_no_stamps_count" integer,  -- 22) Е: Брой бюлетини за кмет на община по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "e_total_invalid_ballots" integer,            -- 23) Е: Брой на недействителните гласове (бюлетини) за кмет на община (сумата от числата по т. 16, т. 17, т. 18, т. 19, т. 20)
  "e_total_valid_ballots" integer               -- 24) Е: Брой на действителните гласове (бюлетини)за кмет на община (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два печата на съответната секционна избирателна комисия)
);

create table _2011_mayor_1_sections(
  "section_type" text,       -- 1) Знак, определящ вида на секцията
  "section_id" text,         -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,      -- 3) Име на област
  "municipality_name" text,  -- 4) Име на община
  "location_name" text,      -- 5) Име на населено място
  "ekatte" integer,          -- 6) ЕКАТТЕ на населеното място
  "location_name_2" integer, -- 7) Име на кметство
  "ekatte_location" integer  -- 8) ЕКАТТЕ на кметството
);

create table _2011_mayor_municipality_1_sections(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" text,        -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област
  "municipality_name" text, -- 4) Име на община
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място
);
create table _2011_council_region_1_sections(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" text,        -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област
  "municipality_name" text, -- 4) Име на община
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място
);

create table _2011_mayor_2_sections(
  "section_type" text,       -- 1) Знак, определящ вида на секцията
  "section_id" text,         -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,      -- 3) Име на област
  "municipality_name" text,  -- 4) Име на община
  "location_name" text,      -- 5) Име на населено място
  "ekatte" integer,          -- 6) ЕКАТТЕ на населеното място
  "location_name_2" integer, -- 7) Име на кметство
  "ekatte_location" integer  -- 8) ЕКАТТЕ на кметството
);

create table _2011_mayor_municipality_2_sections(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" text,        -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област
  "municipality_name" text, -- 4) Име на община
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място
);


create table _2011_mayor_1_votes(
  "section_id" text,                 -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "district_id" text,                -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer   -- действителни гласове
);

create table _2011_mayor_municipality_1_votes(
    "section_type" text,               -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                 -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer,   -- действителни гласове
  "party12_id" integer,              -- № П/К/ИК
  "party12_valid_ballots" integer,   -- действителни гласове
  "party13_id" integer,              -- № П/К/ИК
  "party13_valid_ballots" integer,   -- действителни гласове
  "party14_id" integer,              -- № П/К/ИК
  "party14_valid_ballots" integer,   -- действителни гласове
  "party15_id" integer,              -- № П/К/ИК
  "party15_valid_ballots" integer,   -- действителни гласове
  "party16_id" integer,              -- № П/К/ИК
  "party16_valid_ballots" integer,   -- действителни гласове
  "party17_id" integer,              -- № П/К/ИК
  "party17_valid_ballots" integer,   -- действителни гласове
  "party18_id" integer,              -- № П/К/ИК
  "party18_valid_ballots" integer,   -- действителни гласове
  "party19_id" integer,              -- № П/К/ИК
  "party19_valid_ballots" integer,   -- действителни гласове
  "party20_id" integer,              -- № П/К/ИК
  "party20_valid_ballots" integer,   -- действителни гласове
  "party21_id" integer,              -- № П/К/ИК
  "party21_valid_ballots" integer,   -- действителни гласове
  "party22_id" integer,              -- № П/К/ИК
  "party22_valid_ballots" integer,   -- действителни гласове
  "party23_id" integer,              -- № П/К/ИК
  "party23_valid_ballots" integer,   -- действителни гласове
  "party24_id" integer,              -- № П/К/ИК
  "party24_valid_ballots" integer   -- действителни гласове
);

create table _2011_council_region_1_votes(
  "section_type" text,               -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                 -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer,   -- действителни гласове
  "party12_id" integer,              -- № П/К/ИК
  "party12_valid_ballots" integer,   -- действителни гласове
  "party13_id" integer,              -- № П/К/ИК
  "party13_valid_ballots" integer,   -- действителни гласове
  "party14_id" integer,              -- № П/К/ИК
  "party14_valid_ballots" integer,   -- действителни гласове
  "party15_id" integer,              -- № П/К/ИК
  "party15_valid_ballots" integer,   -- действителни гласове
  "party16_id" integer,              -- № П/К/ИК
  "party16_valid_ballots" integer,   -- действителни гласове
  "party17_id" integer,              -- № П/К/ИК
  "party17_valid_ballots" integer,   -- действителни гласове
  "party18_id" integer,              -- № П/К/ИК
  "party18_valid_ballots" integer,   -- действителни гласове
  "party19_id" integer,              -- № П/К/ИК
  "party19_valid_ballots" integer,   -- действителни гласове
  "party20_id" integer,              -- № П/К/ИК
  "party20_valid_ballots" integer,   -- действителни гласове
  "party21_id" integer,              -- № П/К/ИК
  "party21_valid_ballots" integer,   -- действителни гласове
  "party22_id" integer,              -- № П/К/ИК
  "party22_valid_ballots" integer,   -- действителни гласове
  "party23_id" integer,              -- № П/К/ИК
  "party23_valid_ballots" integer,   -- действителни гласове
  "party24_id" integer,              -- № П/К/ИК
  "party24_valid_ballots" integer,   -- действителни гласове
  "party25_id" integer,              -- № П/К/ИК
  "party25_valid_ballots" integer,   -- действителни гласове
  "party26_id" integer,              -- № П/К/ИК
  "party26_valid_ballots" integer,   -- действителни гласове
  "party27_id" integer,              -- № П/К/ИК
  "party27_valid_ballots" integer,   -- действителни гласове
  "party28_id" integer,              -- № П/К/ИК
  "party28_valid_ballots" integer,   -- действителни гласове
  "party29_id" integer,              -- № П/К/ИК
  "party29_valid_ballots" integer,   -- действителни гласове
  "party30_id" integer,              -- № П/К/ИК
  "party30_valid_ballots" integer,   -- действителни гласове
  "party31_id" integer,              -- № П/К/ИК
  "party31_valid_ballots" integer,   -- действителни гласове
  "party32_id" integer,              -- № П/К/ИК
  "party32_valid_ballots" integer,   -- действителни гласове
  "party33_id" integer,              -- № П/К/ИК
  "party33_valid_ballots" integer,   -- действителни гласове
  "party34_id" integer,              -- № П/К/ИК
  "party34_valid_ballots" integer,   -- действителни гласове
  "party35_id" integer,              -- № П/К/ИК
  "party35_valid_ballots" integer,   -- действителни гласове
  "party36_id" integer,              -- № П/К/ИК
  "party36_valid_ballots" integer,   -- действителни гласове
  "party37_id" integer,              -- № П/К/ИК
  "party37_valid_ballots" integer,   -- действителни гласове
  "party38_id" integer,              -- № П/К/ИК
  "party38_valid_ballots" integer,   -- действителни гласове
  "party39_id" integer,              -- № П/К/ИК
  "party39_valid_ballots" integer,   -- действителни гласове
  "party40_id" integer,              -- № П/К/ИК
  "party40_valid_ballots" integer,   -- действителни гласове
  "party41_id" integer,              -- № П/К/ИК
  "party41_valid_ballots" integer,   -- действителни гласове
  "party42_id" integer,              -- № П/К/ИК
  "party42_valid_ballots" integer,   -- действителни гласове
  "party43_id" integer,              -- № П/К/ИК
  "party43_valid_ballots" integer,   -- действителни гласове
  "party44_id" integer,              -- № П/К/ИК
  "party44_valid_ballots" integer,   -- действителни гласове
  "party45_id" integer,              -- № П/К/ИК
  "party45_valid_ballots" integer,   -- действителни гласове
  "party46_id" integer,              -- № П/К/ИК
  "party46_valid_ballots" integer,   -- действителни гласове
  "party47_id" integer,              -- № П/К/ИК
  "party47_valid_ballots" integer    -- действителни гласове
);

create table _2011_mayor_2_votes(
  "section_id" text,                -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,               -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,              -- № П/К/ИК
  "party1_valid_ballots" integer,   -- действителни гласове
  "party2_id" integer,              -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party3_id" integer,              -- № П/К/ИК
  "party3_valid_ballots" integer    -- действителни гласове
);

create table _2011_mayor_municipality_2_votes(
  "section_id" text,              -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,             -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,            -- № П/К/ИК
  "party1_valid_ballots" integer, -- действителни гласове
  "party2_id" integer,            -- № П/К/ИК
  "party2_valid_ballots" integer  -- действителни гласове
);
