
CREATE TABLE _2009_parliament_majorvotes(
  "section_id" text,       -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "major1_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major2_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major3_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major4_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major5_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major6_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major7_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major8_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major9_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major10_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major11_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major12_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major13_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major14_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major15_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major16_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major17_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major18_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major19_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major20_valid" integer  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
);

CREATE TABLE _2009_parliament_partyvotes(
  "section_id" text,       -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "party1_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party2_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party3_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party4_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party5_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party6_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party7_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party8_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party9_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party10_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party11_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party12_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party13_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party14_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party15_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party16_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party17_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party18_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party19_valid" integer  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
);

CREATE TABLE _2009_parliament_protocols(
  "section_id" text,                             -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                        -- 2) (т.1) Брой на избирателите в основния и допълнителния избирателен списък (т. 1 = т. 2 + т. 3 + т. 4)
  "total_voters_in_section" integer,             -- 3) (т.2) Брой на избирателите в основния избирателен списък (равен на броя на избирателите в избирателния списък и в списъка за гласуване с подвижна избирателна кутия (когато има такъв) при предаването му на СИК) 
  "added_on_elections_day" integer,              -- 4) (т.3) Брой на избирателите, вписани от СИК в допълнителната страница на основния избирателен списък в изборния ден
  "added_voters" integer,                        -- 5) (т.4) Брой на избирателите в допълнителния избирателен списък (т. 4 = т. 5 + т. 6 + т. 7)
  "vote_another_place_count" integer,            -- 6) (т.5) Брой на удостоверенията за гласуване на друго място
  "student_declaration_count" integer,           -- 7) (т.6) Брой на декларациите на ученици и студенти по чл. 36, ал. 11 от ЗИНП
  "voters_with_eye_problems_count" integer,      -- 8) (т.7) Брой на декларациите на избиратели с физически или зрителни увреждания по чл. 88а, ал. 3 от ЗИНП
  "decl84a" integer,                             -- 9) (т.8) Брой на декларациите на служебно заети лица по чл. 84а от ЗИНП
  "voters_by_signature" integer,                 -- 10) (т.9) Брой на гласувалите избиратели според подписите в избирателните списъци (основен и допълнителен)
  "machine_vote_count" integer,                  -- 11) (т.10) Брой избиратели гласували по електронен път според отбелязванията в графа „Забележки” на избирателния списък <b>(попълва се от СИК, в която се провежда електронно гласуване, останалите СИК вписват нула)</b>
  "major_ballots_in_box" integer,                -- 12) (т.11) Брой на намерените в избирателните кутии бюлетини за мажоритарни кандидати
  "invalid_major_ballots" integer,               -- 13) (т.12) Брой на намерените бюлетини за мажоритарни кандидати, които не са по установения образец
  "invalid_major_count_special_symbols" integer, -- 14) (т.13) Брой на намерените бюлетини за мажоритарни кандидати с вписани в тях специални символи като букви и числа, позволяващи да се разкрие самоличността на избирателя
  "empty_major_ballots" integer,                 -- 15) (т.14) Брой на намерените бюлетини за мажоритарни кандидати по установения образец, в които не е отразен вотът на избирателя  и които съдържат два печата на СИК
  "major_ballots_multiple_choice" integer,       -- 16) (т.15) Брой на намерените бюлетини за мажоритарни кандидати по установения образец, с отбелязан вот за двама или повече кандидати и които съдържат два печата на СИК
  "major_ballots_without_stamp" integer,         -- 17) (т.16) Брой на намерените бюлетини за мажоритарни кандидати, които не съдържат два печата на СИК
  "ballots_in_box" integer,                      -- 18) (т.17) Брой на недействителните гласове за мажоритарни кандидати (т. 17 = т. 12 + т. 13 + т. 14 + т. 15 + т. 16)
  "total_major_invalid_ballots" integer,         -- 19) (т.18) Брой на намерените бюлетини за мажоритарни кандидати по установения образец с отбелязан вот за един кандидат и които съдържат два печата на СИК (брой на действителните гласове за мажоритарни кандидати)
  "ballots_with_special_symbols" integer,        -- 20) (т.20) Брой на намерените в избирателните кутии бюлетини за кандидатски листи
  "empty_ballots" integer,                       -- 21) (т.21) Брой на намерените бюлетини за кандидатски листи, които не са по установения образец
  "invalid_ballots_multiple_choice" integer,     -- 22) (т.22) Брой на намерените бюлетини за кандидатски листи с вписани в тях специални символи като букви и числа, позволяващи да се разкрие самоличността на избирателя
  "ballots_without_two_stamps" integer,          -- 23) (т.23) Брой на намерените бюлетини за кандидатски листи по установения образец, в които не е отразен вотът на избирателя и които съдържат два печата на СИК
  "invalid_ballots" integer,                     -- 24) (т.24) Брой на намерените бюлетини за кандидатски листи по установения образец, с отбелязан вот за двама или повече кандидати и които съдържат два печата на СИК
  "invalid_ballots_no_stamps_count" integer,     -- 25) (т.25) Брой на намерените бюлетини за кандидатски листи, които не съдържат два печата на СИК
  "total_invalid_ballots" integer,               -- 26) (т.26) Брой на недействителните гласове за кандидатски листи (т. 26 = т. 21 + т. 22 + т. 23 + т. 24 + т. 25)
  "total_valid_ballots" integer,                 -- 27) (т.27) Брой на намерените бюлетини за кандидатски листи по установения образец с отбелязан вот за една кандидатска листа и които съдържат два печата на СИК (брой на действителните гласове за кандидатски листи)
  "total_invalid_881011" integer                 -- 28) (т.29) Брой на недействителните бюлетини по чл. 88, ал. 10 и 11 от ЗИНП 
);

CREATE TABLE _2009_parliament_sections(
  "section_id" text,    -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "location_name" text, -- 2) Име на Населено място
  "ekatte" integer,     -- 3) ЕКАТТЕ на населеното място
  "" text
);