CREATE TABLE _2014_european_candidates(
  "party_id" text,       -- 1) Номер на партия/коалиция/инициативен комитет
  "party_name" integer,  -- 2) Име на партия/коалиция/инициативен комитет
  "candidate_id" text,   -- 3) Номер на кандидат в листата
  "candidate_name" text -- 4) Име на кандидат
);

CREATE TABLE _2014_european_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);

CREATE TABLE _2014_european_preferences(
  "section_id" text,        -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,       -- 2) Номер на партия
  "candidate_id" integer,   -- 3) Номер на кандидат в кандидатска листа
  "preferences" integer     -- 4) Брой гласове
);


CREATE TABLE _2014_european_protocols(
  "section_id" text,                          -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "number_of_candidates" integer,             -- 2)  А.Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за членове на Европейския парламент от Република България
  "ballots_available" integer,                -- 3)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 78 от изборните книжа
  "total_voters" integer,                     -- 4)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                           -- 5)1.а)Избирателен списък – част І
  "list_2" integer,                           -- 6)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                     -- 7)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,              -- 8)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "u40_1_p20" integer,                        -- 9)4.а)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 20 от изборните книжа
  "ud_vote_other_place" integer,              -- 10)4.б)удостоверения за гласуване на друго място (чл. 240 във връзка с чл. 34 от ИК) - Приложение № 22 от изборните книжа
  "unused_ballots" integer,                   -- 11)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,                -- 12)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,       -- 13)5.в)бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,            -- 14)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,           -- 15)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,          -- 16)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,                   -- 17)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots" integer,                  -- 18)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини) – броят на недействителните бюлетини е равен на броя на бюлетините, които не са по установен образец, в които има вписани специални символи, като букви, цифри или други знаци, бюлетината не съдържа два печата на съответната СИК; в бюлетината вотът на избирателя не е отбелязан със знак „Х“ или „V“ и с химикал, пишещ със син цвят; отразеният в бюлетината вот на избирателя не може да бъде установен еднозначно, тъй като знакът „Х“ или „V“ е поставен в квадратчетата за две или повече кандидатски листи или засяга повече от едно квадратче за гласуване; в бюлетината се отбелязани предпочитания (преференции) със знак, различен от „Х“ или „V“ или с химикал, който не пише със син цвят; вотът на избирателя не е отбелязан с химикал, пишещ със син цвят
  "valid_ballots" integer,                    -- 19)  8.Брой на действителните гласове (броят на действителните гласове е равен на броя на бюлетините по установения образец, съдържащи два печата на гърба на съответната СИК, върху които вотът на избирателя е отбелязан със знак „Х“ или „V“ с химикал, пишещ със син цвят, само в едно от квадратчетата за гласуване)
  "invalid_empty_or_multiple_choice" integer, -- 20)    Недействителни гласове за всички листи или за повече от една листа (празна бюлетина, бюлетина, в която са зачертани всички листи или е гласувано за повече от една листа)
  "serial_numbers" integer                    -- 21) Серийни номера на страници на протокол, разделени с |
);

CREATE TABLE _2014_european_sections(
  "section_id" text,        -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "location_name" text,     -- 2) Име на Населено място
  "ekatte" integer,         -- 3) ЕКАТТЕ на населеното място
  "mobile_section" boolean, -- 4) Флаг мобилна секция
  "ship_section" boolean,   -- 5) Флаг корабна секция
  "machine_voting" boolean  -- 6) Флаг машинно гласуване
);

CREATE TABLE _2014_european_votes(
  "section_id" text,      -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "party1_valid" integer,    -- 2) Гласове(действителни) за:  1. БЪЛГАРСКАТА ЛЕВИЦА
  "party1_invalid" integer,  -- 2) Гласове(недействителни) за:  1. БЪЛГАРСКАТА ЛЕВИЦА
  "party2_valid" integer,    -- 3) Гласове(действителни) за:  2. ПП ГЛАС НАРОДЕН
  "party2_invalid" integer,  -- 3) Гласове(недействителни) за:  2. ПП ГЛАС НАРОДЕН
  "party3_valid" integer,    -- 4) Гласове(действителни) за:  3. ПАРТИЯ НА ЗЕЛЕНИТЕ
  "party3_invalid" integer,  -- 4) Гласове(недействителни) за:  3. ПАРТИЯ НА ЗЕЛЕНИТЕ
  "party4_valid" integer,    -- 5) Гласове(действителни) за:  4. ПП ЗЕЛЕНА ПАРТИЯ
  "party4_invalid" integer,  -- 5) Гласове(недействителни) за:  4. ПП ЗЕЛЕНА ПАРТИЯ
  "party5_valid" integer,    -- 6) Гласове(действителни) за:  6. Християндемократическа партия на България
  "party5_invalid" integer,  -- 6) Гласове(недействителни) за:  6. Християндемократическа партия на България
  "party6_valid" integer,    -- 7) Гласове(действителни) за:  8. БЪЛГАРСКА НАЦИОНАЛНО-ПАТРИОТИЧНА ПАРТИЯ
  "party6_invalid" integer,  -- 7) Гласове(недействителни) за:  8. БЪЛГАРСКА НАЦИОНАЛНО-ПАТРИОТИЧНА ПАРТИЯ
  "party7_valid" integer,    -- 8) Гласове(действителни) за:  9. СИНЬО ЕДИНСТВО
  "party7_invalid" integer,  -- 8) Гласове(недействителни) за:  9. СИНЬО ЕДИНСТВО
  "party8_valid" integer,    -- 9) Гласове(действителни) за: 10. РЕФОРМАТОРСКИ БЛОК
  "party8_invalid" integer,  -- 9) Гласове(недействителни) за: 10. РЕФОРМАТОРСКИ БЛОК
  "party9_valid" integer,    -- 10) Гласове(действителни) за: 11. ПП НАЦИОНАЛЕН ФРОНТ ЗА СПАСЕНИЕ НА БЪЛГАРИЯ(ПП НФСБ)
  "party9_invalid" integer,  -- 10) Гласове(недействителни) за: 11. ПП НАЦИОНАЛЕН ФРОНТ ЗА СПАСЕНИЕ НА БЪЛГАРИЯ(ПП НФСБ)
  "party10_valid" integer,   -- 11) Гласове(действителни) за: 12. ПП БАСТА
  "party10_invalid" integer, --  11) Гласове(недействителни) за: 12. ПП БАСТА
  "party11_valid" integer,   -- 12) Гласове(действителни) за: 13. АБВ - АЛТЕРНАТИВА ЗА БЪЛГАРСКО ВЪЗРАЖДАНЕ
  "party11_invalid" integer, --  12) Гласове(недействителни) за: 13. АБВ - АЛТЕРНАТИВА ЗА БЪЛГАРСКО ВЪЗРАЖДАНЕ
  "party12_valid" integer,   -- 13) Гласове(действителни) за: 15. КОАЛИЦИЯ ЗА БЪЛГАРИЯ
  "party12_invalid" integer, --  13) Гласове(недействителни) за: 15. КОАЛИЦИЯ ЗА БЪЛГАРИЯ
  "party13_valid" integer,   -- 14) Гласове(действителни) за: 16. Инициативен комитет
  "party13_invalid" integer, --  14) Гласове(недействителни) за: 16. Инициативен комитет
  "party14_valid" integer,   -- 15) Гласове(действителни) за: 17. Коалиция КОД - Антония Първанова, Илиана Раева - ОБ, НДСВ, СДП
  "party14_invalid" integer, --  15) Гласове(недействителни) за: 17. Коалиция КОД - Антония Първанова, Илиана Раева - ОБ, НДСВ, СДП
  "party15_valid" integer,   -- 16) Гласове(действителни) за: 18. ПП ГЕРБ
  "party15_invalid" integer, --  16) Гласове(недействителни) за: 18. ПП ГЕРБ
  "party16_valid" integer,   -- 17) Гласове(действителни) за: 19. Инициативен комитет
  "party16_invalid" integer, --  17) Гласове(недействителни) за: 19. Инициативен комитет
  "party17_valid" integer,   -- 18) Гласове(действителни) за: 20. ПП АТАКА
  "party17_invalid" integer, --  18) Гласове(недействителни) за: 20. ПП АТАКА
  "party18_valid" integer,   -- 19) Гласове(действителни) за: 21. СЪЮЗ НА КОМУНИСТИТЕ В БЪЛГАРИЯ
  "party18_invalid" integer, --  19) Гласове(недействителни) за: 21. СЪЮЗ НА КОМУНИСТИТЕ В БЪЛГАРИЯ
  "party19_valid" integer,   -- 20) Гласове(действителни) за: 25. БКП
  "party19_invalid" integer, --  20) Гласове(недействителни) за: 25. БКП
  "party20_valid" integer,   -- 21) Гласове(действителни) за: 26. Инициативен комитет
  "party20_invalid" integer, --  21) Гласове(недействителни) за: 26. Инициативен комитет
  "party21_valid" integer,   -- 22) Гласове(действителни) за: 27. ЗЕЛЕНИТЕ
  "party21_invalid" integer, --  22) Гласове(недействителни) за: 27. ЗЕЛЕНИТЕ
  "party22_valid" integer,   -- 23) Гласове(действителни) за: 28. БЪЛГАРИЯ БЕЗ ЦЕНЗУРА,ВМРО,ЗНС,ГЕРГЬОВДЕН
  "party22_invalid" integer, --  23) Гласове(недействителни) за: 28. БЪЛГАРИЯ БЕЗ ЦЕНЗУРА,ВМРО,ЗНС,ГЕРГЬОВДЕН
  "party23_valid" integer,   -- 24) Гласове(действителни) за: 29. ДПС - Движение за права и свободи
  "party23_invalid" integer, --  24) Гласове(недействителни) за: 29. ДПС - Движение за права и свободи
  "party24_valid" integer,   -- 25) Гласове(действителни) за: 30. Коалиция НАЦИОНАЛИСТИЧЕСКИ ПАРТИИ НА БЪЛГАРИЯ (НПБ)
  "party24_invalid" integer, --  25) Гласове(недействителни) за: 30. Коалиция НАЦИОНАЛИСТИЧЕСКИ ПАРТИИ НА БЪЛГАРИЯ (НПБ)
  "" text
);
