create table _2016_president_1_candidates(
  "party_id" integer,    -- 1) Номер на партия/коалиция/инициативен комитет
  "party_name" integer,  -- 2) Име на партия/коалиция/инициативен комитет
  "candidate_id" text,   -- 3) Номер на кандидат в листата
  "candidate_name" text, -- 4) Име на кандидат
  "chosen_one" text      -- 5) Флаг за избран кандидат
);

create table _2016_president_2_candidates(
  "party_id" integer,    -- 1) Номер на партия/коалиция/инициативен комитет
  "party_name" integer,  -- 2) Име на партия/коалиция/инициативен комитет
  "candidate_id" text,   -- 3) Номер на кандидат в листата
  "candidate_name" text, -- 4) Име на кандидат
  "chosen_one" text      -- 5) Флаг за избран кандидат
);

create table _2016_president_1_protocols(
  "form_number" text,                   -- 1) № формуляр
  "section_id" text,                    -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,                   -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "serial_numbers" text,                -- 4) Серийни номера на страниците на протокола, разделени с |
  "ballots_available" text,             -- 5) А.Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 от ИК
  "total_voters" integer,               -- 6) Формуляр № 1:  1.Брой на избирателите според избирателния списък при предаването му на СИК
                                        --    Формуляр № 7:   1.Брой на избирателите според списъка за гласуване извън страната при предаването му на СИК
                                        --    Формуляр № 8:   1.Брой на избирателите според избирателния списък при предаването му на СИК
  "added_voters" text,                  -- 7) Формуляр № 1:  2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
                                        --    Формуляр № 7:   2.Брой на избирателите, вписани в изборния ден
                                        --    Формуляр № 8:   2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
  "voters_by_signature" integer,        -- 8) Формуляр № 8:   3.Общ брой на гласувалите избиратели според положените подписи в избирателния списък, включително подписите в допълнителната страница (под чертата)
                                        --    Формуляр № 1:  3.Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница (под чертата)
                                        --    Формуляр № 7:   3.Брой на гласувалите избиратели според положените подписи в списъка за гласуване извън страната
  "voters_with_paper" text,             -- 9) Формуляр № 1:  -.
                                        --    Формуляр № 7:   -.
                                        --    Формуляр № 8: 3.а)Брой избиратели, гласували с хартиена бюлетина
  "voters_with_machine" text,           -- 10) Формуляр № 1:  -.
                                        --     Формуляр № 7:   -.
                                        --     Формуляр № 8: 3.б)Брой на потвърдените гласове от машинното гласуване
  "unused_ballots" text,                -- 11) 4.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,          -- 12) 4.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer, -- 13) 4.в)брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" text,         -- 14) 4.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" text,        -- 15) 4.д)брой на недействителните бюлетини по чл. 228 от ИК(показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,    -- 16) 4.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" text,                -- 17) Формуляр № 1:  5.Брой на намерените в избирателната кутия бюлетини
                                        --     Формуляр № 7:   5.Брой на намерените в избирателната кутия бюлетини
                                        --     Формуляр № 8:   5.Общ брой на намерените в избирателната кутия бюлетини и потвърдените гласове от машинното гласуване
  "ballots_in_box_machine" text,        --  18) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 5.а)Брой на намерените в избирателната кутия бюлетини
  "machine_votes_count" text,           --  19) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 5.б)Брой на потвърдените гласове от машинното гласуване
  "total_invalid_ballots" integer,      --  20) Формуляр № 1:  6.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
                                        --      Формуляр № 7:   6.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
                                        --      Формуляр № 8:   6.Общ брой на недействителните гласове (брой на намерените в избирателната кутия недействителни бюлетини и празни гласове от машинното гласуване)
  "total_invalid_ballots_?" text,       --  21) Формуляр № 1:  -.
                                        --    Формуляр № 7:   -.
                                        --    Формуляр № 8: 6.а)брой на намерените в избирателната кутия недействителни гласове (бюлетини) (Б)
  "machine_votes_no_one" text,          --  22) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 6.б)брой на празните гласове от машинното гласуване (МГ)
  "valid_ballots" text,                 --  23) Формуляр № 1:  7.Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
                                        --      Формуляр № 7:   7.Общ брой намерени в избирателната кутия действителните гласове (бюлетини)
                                        --      Формуляр № 8:   7.Общ брой на действителни гласове (брой намерени в избирателната кутия действителни бюлетини и действителни гласове от машинното гласуване) (сумата от числата по т. 7.1. и т. 7.2.) (Б + МГ)
  "valid_ballots_machine" integer,      --  24) Формуляр № 1: 7.1брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети
                                        --      Формуляр № 7:  7.1брой на действителните гласове, подадени за кандидатски листи на партии, коалиции и инициативни комитети
                                        --      Формуляр № 8:  7.1брой на действителните гласове, подадени за кандидатите на партии, коалиции и инициативни комитети (Б+МГ)
  "valid_ballots_machine_b" text,       --  25) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.1.брой на намерените в избирателната кутия действителни гласове (бюлетини), подадени за кандидатските листи на партии, коалиции и инициативни комитети (Б)
  "valid_ballots_machine_mg" integer,   --  26) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.1.брой действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети от машинното гласуване (МГ)
  "valid_no_one" text,                  --  27) Формуляр № 1: 7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
                                        --      Формуляр № 7:  7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
                                        --      Формуляр № 8:  7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“ (Б+МГ)
  "total_no_one_ballots" text,          --  28) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.2.брой на намерените в избирателната кутия действителни гласове (бюлетини) с отбелязване „Не подкрепям никого“ (Б)
  "total_no_one_machine" text,          --  29) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.2.брой действителните гласове с отбелязване „Не подкрепям никого“ от машинното гласуване (МГ)
  "mg" integer,                         --  30) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8:   -.от маш.глас. (МГ)
  "b" text,                             -- 31) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8:   -.от бюлетини (Б)
  "total_empty" integer                 --  32) Формуляр № 1:  -.Празни бюлетини (хартиени бюлетини); бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
                                        --      Формуляр № 7:   -.Празни бюлетини (хартиени бюлетини); бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
                                        --      Формуляр № 8:   -.Общо МГ + Б
);

create table _2016_president_2_protocols(
  "form_number" text,                   -- 1) № формуляр
  "section_id" text,                    -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,                   -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "serial_numbers" text,                -- 4) Серийни номера на страниците на протокола, разделени с |
  "ballots_available" text,             -- 5) А.Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 от ИК
  "total_voters" integer,               -- 6) Формуляр № 1:  1.Брой на избирателите според избирателния списък при предаването му на СИК
                                        --    Формуляр № 7:   1.Брой на избирателите според списъка за гласуване извън страната при предаването му на СИК
                                        --    Формуляр № 8:   1.Брой на избирателите според избирателния списък при предаването му на СИК
  "added_voters" text,                  -- 7) Формуляр № 1:  2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
                                        --    Формуляр № 7:   2.Брой на избирателите, вписани в изборния ден
                                        --    Формуляр № 8:   2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
  "voters_by_signature" integer,        -- 8) Формуляр № 8:   3.Общ брой на гласувалите избиратели според положените подписи в избирателния списък, включително подписите в допълнителната страница (под чертата)
                                        --    Формуляр № 1:  3.Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница (под чертата)
                                        --    Формуляр № 7:   3.Брой на гласувалите избиратели според положените подписи в списъка за гласуване извън страната
  "voters_with_paper" text,             -- 9) Формуляр № 1:  -.
                                        --    Формуляр № 7:   -.
                                        --    Формуляр № 8: 3.а)Брой избиратели, гласували с хартиена бюлетина
  "voters_with_machine" text,           -- 10) Формуляр № 1:  -.
                                        --     Формуляр № 7:   -.
                                        --     Формуляр № 8: 3.б)Брой на потвърдените гласове от машинното гласуване
  "unused_ballots" text,                -- 11) 4.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,          -- 12) 4.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer, -- 13) 4.в)брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" text,         -- 14) 4.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" text,        -- 15) 4.д)брой на недействителните бюлетини по чл. 228 от ИК(показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,    -- 16) 4.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" text,                -- 17) Формуляр № 1:  5.Брой на намерените в избирателната кутия бюлетини
                                        --     Формуляр № 7:   5.Брой на намерените в избирателната кутия бюлетини
                                        --     Формуляр № 8:   5.Общ брой на намерените в избирателната кутия бюлетини и потвърдените гласове от машинното гласуване
  "ballots_in_box_machine" text,        --  18) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 5.а)Брой на намерените в избирателната кутия бюлетини
  "machine_votes_count" text,           --  19) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 5.б)Брой на потвърдените гласове от машинното гласуване
  "total_invalid_ballots" integer,      --  20) Формуляр № 1:  6.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
                                        --      Формуляр № 7:   6.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
                                        --      Формуляр № 8:   6.Общ брой на недействителните гласове (брой на намерените в избирателната кутия недействителни бюлетини и празни гласове от машинното гласуване)
  "total_invalid_ballots_?" text,       --  21) Формуляр № 1:  -.
                                        --    Формуляр № 7:   -.
                                        --    Формуляр № 8: 6.а)брой на намерените в избирателната кутия недействителни гласове (бюлетини) (Б)
  "machine_votes_no_one" text,          --  22) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 6.б)брой на празните гласове от машинното гласуване (МГ)
  "valid_ballots" text,                 --  23) Формуляр № 1:  7.Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
                                        --      Формуляр № 7:   7.Общ брой намерени в избирателната кутия действителните гласове (бюлетини)
                                        --      Формуляр № 8:   7.Общ брой на действителни гласове (брой намерени в избирателната кутия действителни бюлетини и действителни гласове от машинното гласуване) (сумата от числата по т. 7.1. и т. 7.2.) (Б + МГ)
  "valid_ballots_machine" integer,      --  24) Формуляр № 1: 7.1брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети
                                        --      Формуляр № 7:  7.1брой на действителните гласове, подадени за кандидатски листи на партии, коалиции и инициативни комитети
                                        --      Формуляр № 8:  7.1брой на действителните гласове, подадени за кандидатите на партии, коалиции и инициативни комитети (Б+МГ)
  "valid_ballots_machine_b" text,       --  25) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.1.брой на намерените в избирателната кутия действителни гласове (бюлетини), подадени за кандидатските листи на партии, коалиции и инициативни комитети (Б)
  "valid_ballots_machine_mg" integer,   --  26) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.1.брой действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети от машинното гласуване (МГ)
  "valid_no_one" text,                  --  27) Формуляр № 1: 7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
                                        --      Формуляр № 7:  7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
                                        --      Формуляр № 8:  7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“ (Б+МГ)
  "total_no_one_ballots" text,          --  28) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.2.брой на намерените в избирателната кутия действителни гласове (бюлетини) с отбелязване „Не подкрепям никого“ (Б)
  "total_no_one_machine" text,          --  29) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8: 7.2.брой действителните гласове с отбелязване „Не подкрепям никого“ от машинното гласуване (МГ)
  "mg" integer,                         --  30) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8:   -.от маш.глас. (МГ)
  "b" text,                             -- 31) Формуляр № 1:  -.
                                        --      Формуляр № 7:   -.
                                        --      Формуляр № 8:   -.от бюлетини (Б)
  "total_empty" integer                 --  32) Формуляр № 1:  -.Празни бюлетини (хартиени бюлетини); бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
                                        --      Формуляр № 7:   -.Празни бюлетини (хартиени бюлетини); бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
                                        --      Формуляр № 8:   -.Общо МГ + Б
);

create table _2016_president_1_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2016_president_2_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2016_president_1_votes(
  "section_id" text,                      -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,               -- № П/К/ИК;
  "party1_valid_ballots" integer,    -- действителни гласове
  "party1_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party1_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party1_invalid_ballots" integer,  -- недействителни гласове
  "party2_id" integer,               -- № П/К/ИК;
  "party2_valid_ballots" integer,    -- действителни гласове
  "party2_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party2_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party2_invalid_ballots" integer,  -- недействителни гласове
  "party3_id" integer,               -- № П/К/ИК;
  "party3_valid_ballots" integer,    -- действителни гласове
  "party3_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party3_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party3_invalid_ballots" integer,  -- недействителни гласове
  "party4_id" integer,               -- № П/К/ИК;
  "party4_valid_ballots" integer,    -- действителни гласове
  "party4_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party4_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party4_invalid_ballots" integer,  -- недействителни гласове
  "party5_id" integer,               -- № П/К/ИК;
  "party5_valid_ballots" integer,    -- действителни гласове
  "party5_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party5_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party5_invalid_ballots" integer,  -- недействителни гласове
  "party6_id" integer,               -- № П/К/ИК;
  "party6_valid_ballots" integer,    -- действителни гласове
  "party6_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party6_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party6_invalid_ballots" integer,  -- недействителни гласове
  "party7_id" integer,               -- № П/К/ИК;
  "party7_valid_ballots" integer,    -- действителни гласове
  "party7_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party7_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party7_invalid_ballots" integer,  -- недействителни гласове
  "party8_id" integer,               -- № П/К/ИК;
  "party8_valid_ballots" integer,    -- действителни гласове
  "party8_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party8_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party8_invalid_ballots" integer,  -- недействителни гласове
  "party9_id" integer,               -- № П/К/ИК;
  "party9_valid_ballots" integer,    -- действителни гласове
  "party9_valid_machine_b" integer,  -- действителни гласове (Б) от протоколите с машинно гласуване
  "party9_valid_machine_m" integer,  -- действителни гласове (М) от протоколите с машинно гласуване
  "party9_invalid_ballots" integer,  -- недействителни гласове
  "party10_id" integer,              -- № П/К/ИК;
  "party10_valid_ballots" integer,   -- действителни гласове
  "party10_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party10_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party10_invalid_ballots" integer, -- недействителни гласове
  "party11_id" integer,              -- № П/К/ИК;
  "party11_valid_ballots" integer,   -- действителни гласове
  "party11_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party11_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party11_invalid_ballots" integer, -- недействителни гласове
  "party12_id" integer,              -- № П/К/ИК;
  "party12_valid_ballots" integer,   -- действителни гласове
  "party12_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party12_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party12_invalid_ballots" integer, -- недействителни гласове
  "party13_id" integer,              -- № П/К/ИК;
  "party13_valid_ballots" integer,   -- действителни гласове
  "party13_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party13_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party13_invalid_ballots" integer, -- недействителни гласове
  "party14_id" integer,              -- № П/К/ИК;
  "party14_valid_ballots" integer,   -- действителни гласове
  "party14_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party14_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party14_invalid_ballots" integer, -- недействителни гласове
  "party15_id" integer,              -- № П/К/ИК;
  "party15_valid_ballots" integer,   -- действителни гласове
  "party15_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party15_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party15_invalid_ballots" integer, -- недействителни гласове
  "party16_id" integer,              -- № П/К/ИК;
  "party16_valid_ballots" integer,   -- действителни гласове
  "party16_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party16_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party16_invalid_ballots" integer, -- недействителни гласове
  "party17_id" integer,              -- № П/К/ИК;
  "party17_valid_ballots" integer,   -- действителни гласове
  "party17_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party17_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party17_invalid_ballots" integer, -- недействителни гласове
  "party18_id" integer,              -- № П/К/ИК;
  "party18_valid_ballots" integer,   -- действителни гласове
  "party18_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party18_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party18_invalid_ballots" integer, -- недействителни гласове
  "party19_id" integer,              -- № П/К/ИК;
  "party19_valid_ballots" integer,   -- действителни гласове
  "party19_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party19_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party19_invalid_ballots" integer, -- недействителни гласове
  "party20_id" integer,              -- № П/К/ИК;
  "party20_valid_ballots" integer,   -- действителни гласове
  "party20_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party20_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party20_invalid_ballots" integer, -- недействителни гласове
  "party21_id" integer,              -- № П/К/ИК;
  "party21_valid_ballots" integer,   -- действителни гласове
  "party21_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party21_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party21_invalid_ballots" integer  -- недействителни гласове
);

create table _2016_president_2_votes(
  "section_id" text,                     -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                 -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,              -- № П/К/ИК;
  "party1_valid_ballots" integer,   -- действителни гласове
  "party1_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party1_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party1_invalid_ballots" integer, -- недействителни гласове
  "party2_id" integer,              -- № П/К/ИК;
  "party2_valid_ballots" integer,   -- действителни гласове
  "party2_valid_machine_b" integer, -- действителни гласове (Б) от протоколите с машинно гласуване
  "party2_valid_machine_m" integer, -- действителни гласове (М) от протоколите с машинно гласуване
  "party2_invalid_ballots" integer  -- недействителни гласове
);