CREATE TABLE _2011_president_1_candidates(
  "party_id" text,            -- 1) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_name" integer,   -- 2) Име на кандидата за президент
  "vice_candidate_name" text, -- 3) Име на кандидата за вицепрезидент
  "party_name" text           -- 4) Име на партията/коалицията/инициативния комитет, издигнал кандидата
);

CREATE TABLE _2011_president_2_candidates(
  "party_id" text,            -- 1) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_name" integer,   -- 2) Име на кандидата за президент
  "vice_candidate_name" text, -- 3) Име на кандидата за вицепрезидент
  "party_name" text           -- 4) Име на партията/коалицията/инициативния комитет, издигнал кандидата
);


CREATE TABLE _2011_president_1_protocols(
  "section_type" integer,                       --1) Знак, определящ вида на секционния протокол
  "section_id" text,                            --2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       --3) Секция: Брой на избирателите според избирателния списък при предаването му на СИК
  "added_on_elections_day" integer,             --4) Секция: Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
  "added_voters" integer,                       --5) Секция: Брой на избирателите в допълнителния избирателен списък
  "number_of_candidates" integer,               --6) Секция: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за президент и вицепрезидент на републиката
  "voters_by_signature" integer,                --7) Секция: Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния избирателен списък
  "invalid_ballots_public" integer,             --8) Секция: Брой на недействителните бюлетини за президент и вицепрезидент на републиката по чл. 180 от ИК (показване начина на гласуване)
  "invalid_ballots_photo" integer,              --9) Секция: Брой на недействителните бюлетини за президент и вицепрезидент на републиката по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_mistake" integer,                    -- 10)Секция:  Брой на сгрешените бюлетини за президент и вицепрезидент на републиката (по чл. 201, ал. 2 от ИК - унищожени с надпис „сгрешена” и подпечатани с печата на СИК)
  "vote_another_place" integer,                 -- 11)Секция:  Брой на удостоверенията за гласуване на друго място  (на лица, служебно заети в произвеждането на изборите по смисъла на §1, т. 13 от ДР на ИК)
  "vote_specific_place" integer,                -- 12)Секция:  Брой на удостоверенията за гласуване в определено населено място (съгласно § 5, т.1 от ДР на ИК)
  "student_declaration" integer,                -- 13)Секция:  Брой на декларациите по чл. 207, ал. 1, т. 3 от ИК (от ученици и студенти)
  "declaration_for_members" integer,            -- 14)Секция:  Брой на декларациите по чл. 194 от ИК (от лица, заети като членове на секционна избирателна комисия или охрана на избирателни секции)
  "declarations_eye_problems" integer,          -- 15)Секция:  Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
  "declaration_back_from_abroad" integer,       -- 16)Секция:  Брой декларации по чл. 57, изр. 2 от ИК (от живеещите извън Република България български граждани, които се намират в страната в изборния ден и са били заличени от избирателните списъци)
  "declaration_44" integer,                     -- 17)Секция:  Брой декларации по чл. 44, ал. 3 от ИК (попълва се само пред СИК извън страната)
  "assistants_count_1" integer,                 -- 18)Секция:  Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
  "assistants_count_3" integer,                 -- 19)Секция:  Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
  "ballots_in_box" integer,                     -- 20)Секция:  Брой на намерените в избирателните урни бюлетини за президент и вицепрезидент на републиката
  "invalid_ballots" integer,                    -- 21)Секция:  Брой бюлетини за президент и вицепрезидент на републиката, които не са по установения образец
  "invalid_ballots_special_characters" integer, -- 22)Секция:  Брой бюлетини за президент и вицепрезидент на републиката с вписани в тях специални символи като букви, цифри или други знаци
  "invalid_not_x" integer,                      -- 23)Секция:  Брой бюлетини за президент и вицепрезидент на републиката по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "invalid_ballots_multiple_chouce" integer,    -- 24)Секция:  Брой бюлетини за президент и вицепрезидент на републиката по установения образец, с отбелязан вот за две или повече кандидатски листи (със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят) или знакът „Х” засяга повече от едно квадратче за гласуване и не може да се установи еднозначно волята на избирателя 
  "invalid_ballots_no_stamps_count" integer,    -- 25)Секция:  Брой бюлетини за президент и вицепрезидент на републиката по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "total_invalid_ballots" integer,              -- 26)Секция:  Брой на недействителните гласове (бюлетини) за президент и вицепрезидент на Републиката (сумата от числата по т. 19, т. 20, т. 21, т. 22 и т. 23)
  "total_valid_ballots" integer                 -- 27)Секция:  Брой на действителните гласове (бюлетини) за президент и вицепрезидент на републиката (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два броя печати на съответната секционна избирателна комисия)
);

CREATE TABLE _2011_president_2_protocols(
  "section_type" integer,                       --1) Знак, определящ вида на секционния протокол
  "section_id" text,                            --2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                       --3) Секция: Брой на избирателите според избирателния списък при предаването му на СИК
  "added_on_elections_day" integer,             --4) Секция: Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
  "added_voters" integer,                       --5) Секция: Брой на избирателите в допълнителния избирателен списък
  "number_of_candidates" integer,               --6) Секция: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за президент и вицепрезидент на републиката
  "voters_by_signature" integer,                --7) Секция: Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния избирателен списък
  "invalid_ballots_public" integer,             --8) Секция: Брой на недействителните бюлетини за президент и вицепрезидент на републиката по чл. 180 от ИК (показване начина на гласуване)
  "invalid_ballots_photo" integer,              --9) Секция: Брой на недействителните бюлетини за президент и вицепрезидент на републиката по чл. 181 от ИК (заснемане с технически средства начина на гласуване)
  "invalid_mistake" integer,                    -- 10)Секция:  Брой на сгрешените бюлетини за президент и вицепрезидент на републиката (по чл. 201, ал. 2 от ИК - унищожени с надпис „сгрешена” и подпечатани с печата на СИК)
  "vote_another_place" integer,                 -- 11)Секция:  Брой на удостоверенията за гласуване на друго място  (на лица, служебно заети в произвеждането на изборите по смисъла на §1, т. 13 от ДР на ИК)
  "vote_specific_place" integer,                -- 12)Секция:  Брой на удостоверенията за гласуване в определено населено място (съгласно § 5, т.1 от ДР на ИК)
  "student_declaration" integer,                -- 13)Секция:  Брой на декларациите по чл. 207, ал. 1, т. 3 от ИК (от ученици и студенти)
  "declaration_for_members" integer,            -- 14)Секция:  Брой на декларациите по чл. 194 от ИК (от лица, заети като членове на секционна избирателна комисия или охрана на избирателни секции)
  "declarations_eye_problems" integer,          -- 15)Секция:  Брой на декларациите по чл. 203, ал. 3 от ИК (от избиратели с увреждане на опорно-двигателния апарат или на зрението)
  "declaration_back_from_abroad" integer,       -- 16)Секция:  Брой декларации по чл. 57, изр. 2 от ИК (от живеещите извън Република България български граждани, които се намират в страната в изборния ден и са били заличени от избирателните списъци)
  "declaration_44" integer,                     -- 17)Секция:  Брой декларации по чл. 44, ал. 3 от ИК (попълва се само пред СИК извън страната)
  "assistants_count_1" integer,                 -- 18)Секция:  Брой на придружителите, вписани в графа "Забележки" на избирателния списък (чл. 204, ал. 3, изр. 1 от ИК)
  "assistants_count_3" integer,                 -- 19)Секция:  Брой на придружителите от списъка за допълнително вписване на придружителите (чл. 204, ал. 3, изр. 2 от ИК)
  "ballots_in_box" integer,                     -- 20)Секция:  Брой на намерените в избирателните урни бюлетини за президент и вицепрезидент на републиката
  "invalid_ballots" integer,                    -- 21)Секция:  Брой бюлетини за президент и вицепрезидент на републиката, които не са по установения образец
  "invalid_ballots_special_characters" integer, -- 22)Секция:  Брой бюлетини за президент и вицепрезидент на републиката с вписани в тях специални символи като букви, цифри или други знаци
  "invalid_not_x" integer,                      -- 23)Секция:  Брой бюлетини за президент и вицепрезидент на републиката по установения образец, в които не е отразен със знак "Х" и с химикал, пишещ със син цвят, вотът на избирателя
  "invalid_ballots_multiple_chouce" integer,    -- 24)Секция:  Брой бюлетини за президент и вицепрезидент на републиката по установения образец, с отбелязан вот за две или повече кандидатски листи (със знак "Х" или друг знак и с химикал, пишещ със син или друг цвят) или знакът „Х” засяга повече от едно квадратче за гласуване и не може да се установи еднозначно волята на избирателя 
  "invalid_ballots_no_stamps_count" integer,    -- 25)Секция:  Брой бюлетини за президент и вицепрезидент на републиката по установения образец, които не съдържат два печата на съответната секционна избирателна комисия (тези бюлетини се унищожават с надпис "унищожена" върху всяка бюлетина)
  "total_invalid_ballots" integer,              -- 26)Секция:  Брой на недействителните гласове (бюлетини) за президент и вицепрезидент на Републиката (сумата от числата по т. 19, т. 20, т. 21, т. 22 и т. 23)
  "total_valid_ballots" integer                 -- 27)Секция:  Брой на действителните гласове (бюлетини) за президент и вицепрезидент на републиката (бюлетини по установения образец с отбелязан вот със знак "Х" и с химикал, пишещ със син цвят, за една кандидатска листа, които съдържат два броя печати на съответната секционна избирателна комисия)
);


CREATE TABLE _2011_president_1_sections(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" text,        -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област(ако е чужбинска секция - държава)
  "municipality_name" text, -- 4) Име на община(ако е чужбинкса секция - празно)
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място(ако е чужбинска секция - празно)
);

CREATE TABLE _2011_president_2_sections(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" text,        -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област(ако е чужбинска секция - държава)
  "municipality_name" text, -- 4) Име на община(ако е чужбинкса секция - празно)
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място(ако е чужбинска секция - празно)
);

CREATE TABLE _2011_president_1_votes(
  "section_type" text,             -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,               -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "party1_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party1_valid_ballots" integer,  -- Гласове за съответния РИК
  "party2_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party2_valid_ballots" integer,  -- Гласове за съответния РИК
  "party3_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party3_valid_ballots" integer,  -- Гласове за съответния РИК
  "party4_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party4_valid_ballots" integer,  -- Гласове за съответния РИК
  "party5_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party5_valid_ballots" integer,  -- Гласове за съответния РИК
  "party6_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party6_valid_ballots" integer,  -- Гласове за съответния РИК
  "party7_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party7_valid_ballots" integer,  -- Гласове за съответния РИК
  "party8_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party8_valid_ballots" integer,  -- Гласове за съответния РИК
  "party9_id" integer,             -- Номер на партия/коалиция/независим кандидат
  "party9_valid_ballots" integer,  -- Гласове за съответния РИК
  "party10_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party10_valid_ballots" integer, -- Гласове за съответния РИК
  "party11_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party11_valid_ballots" integer, -- Гласове за съответния РИК
  "party12_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party12_valid_ballots" integer, -- Гласове за съответния РИК
  "party13_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party13_valid_ballots" integer, -- Гласове за съответния РИК
  "party14_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party14_valid_ballots" integer, -- Гласове за съответния РИК
  "party15_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party15_valid_ballots" integer, -- Гласове за съответния РИК
  "party16_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party16_valid_ballots" integer, -- Гласове за съответния РИК
  "party17_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party17_valid_ballots" integer, -- Гласове за съответния РИК
  "party18_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party18_valid_ballots" integer  -- Гласове за съответния РИК
);

CREATE TABLE _2011_president_2_votes(
"section_type" text,              -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,              -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "party1_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party1_valid_ballots" integer, -- Гласове за съответния РИК
  "party2_id" integer,            -- Номер на партия/коалиция/независим кандидат
  "party2_valid_ballots" integer  -- Гласове за съответния РИК
);