create table _2014_parliament_candidates(
  "region_id" integer,    -- 1) Номер на РИК
  "party_id" integer,     -- 2) Номер на партия/коалиция/инициативен комитет
  "party_name" integer,   -- 3) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 4) Номер на кандидат в листата
  "candidate_name" text   -- 5) Име на кандидат
);

create table _2014_parliament_ind(
  "region_id" integer,  -- Регион
  "party_id" integer,   -- Номер на кандидата в листата
  "candidate_name" text -- Име на кандидата
);

create table _2014_parliament_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);

create table _2014_parliament_preferences(
  "section_id" text,      -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,     -- 2) Номер на партия
  "candidate_id" integer, -- 3) Номер на кандидат в кандидатска листа (0 - за поле "без")
  "votes" integer         -- 4) Брой гласове
);

create table _2014_parliament_protocols(
  "section_id" text,                          -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "number_of_candidates" integer,             -- 2)  А.Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за народни представители
  "ballots_available" integer,                -- 3)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-НС от изборните книжа
  "total_voters" integer,                     -- 4)  1.Брой на избирателите според избирателния списък при предаването му на СИК
  "added_voters" integer,                     -- 5)  2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
  "voters_by_signature" integer,              -- 6)  3.Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница(под чертата)
  "ud40al1" integer,                          -- 7)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 18-НС от изборните книжа
  "ud_vote_other_place" integer,              -- 8)4.б)удостоверения за гласуване на друго място – Приложение № 20-НС от изборните книжа
  "declaration_added_voters" integer,         -- 9)4.в)декларации, подадени от лицата, вписани в допълнителната страница (под чертата)
  "unused_ballots" integer,                   -- 10)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,                -- 11)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,       -- 12)5.в)брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,            -- 13)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,           -- 14)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,          -- 15)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,                   -- 16)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots" integer,                  -- 17)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots" integer,                    -- 18)  8.Брой намерени в избирателната кутия действителните гласове (бюлетини)
  "invalid_empty_or_multiple_choice" integer, -- 19)Празни бюлетини или бюлетини, в които е гласувано за повече от една листа
  "serial_numbers" integer                    -- 20) Серийни номера на страници на протокол, разделени с |
);

create table _2014_parliament_sections(
  "section_id" text,        -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "location_name" text,     -- 2) Име на Населено място
  "ekatte" integer,         -- 3) ЕКАТТЕ на населеното място
  "mobile_section" boolean, -- 4) Флаг мобилна секция
  "ship_section" boolean,   -- 5) Флаг корабна секция
  "machine_voting" boolean  -- 6) Флаг машинно гласуване
);

create table _2014_parliament_votes(
  "section_id" text,         -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "party1_valid" integer,    -- 2) Действителни гласове за:  1. Движение 21
  "party1_invalid" integer,  -- 2) Недействителни гласове за:  1. Движение 21
  "party2_valid" integer,    -- 3) Действителни гласове за:  2. БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ
  "party2_invalid" integer,  -- 3) Недействителни гласове за:  2. БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ
  "party3_valid" integer,    -- 4) Действителни гласове за:  3. БЪЛГАРСКИ НАЦИОНАЛЕН СЪЮЗ - НД
  "party3_invalid" integer,  -- 4) Недействителни гласове за:  3. БЪЛГАРСКИ НАЦИОНАЛЕН СЪЮЗ - НД
  "party4_valid" integer,    -- 5) Действителни гласове за:  4. ПП НОВОТО ВРЕМЕ
  "party4_invalid" integer,  -- 5) Недействителни гласове за:  4. ПП НОВОТО ВРЕМЕ
  "party5_valid" integer,    -- 6) Действителни гласове за:  5. ОБЕДИНЕНА БЪЛГАРИЯ
  "party5_invalid" integer,  -- 6) Недействителни гласове за:  5. ОБЕДИНЕНА БЪЛГАРИЯ
  "party6_valid" integer,    -- 7) Действителни гласове за:  6. СОЦИАЛДЕМОКРАТИЧЕСКА ПАРТИЯ
  "party6_invalid" integer,  -- 7) Недействителни гласове за:  6. СОЦИАЛДЕМОКРАТИЧЕСКА ПАРТИЯ
  "party7_valid" integer,    -- 8) Действителни гласове за:  7. РЕФОРМАТОРСКИ БЛОК – БЗНС, ДБГ, ДСБ, НПСД, СДС
  "party7_invalid" integer,  -- 8) Недействителни гласове за:  7. РЕФОРМАТОРСКИ БЛОК – БЗНС, ДБГ, ДСБ, НПСД, СДС
  "party8_valid" integer,    -- 9) Действителни гласове за:  8. ПП Нова България
  "party8_invalid" integer,  -- 9) Недействителни гласове за:  8. ПП Нова България
  "party9_valid" integer,    -- 10) Действителни гласове за:  9. ПП ГЕРБ
  "party9_invalid" integer,  -- 10) Недействителни гласове за:  9. ПП ГЕРБ
  "party10_valid" integer,   -- 11) Действителни гласове за: 10. ОБЩЕСТВО ЗА НОВА БЪЛГАРИЯ
  "party10_invalid" integer, -- 11) Недействителни гласове за: 10. ОБЩЕСТВО ЗА НОВА БЪЛГАРИЯ
  "party11_valid" integer,   -- 12) Действителни гласове за: 11. АТАКА
  "party11_invalid" integer, -- 12) Недействителни гласове за: 11. АТАКА
  "party12_valid" integer,   -- 13) Действителни гласове за: 12. НДСВ
  "party12_invalid" integer, -- 13) Недействителни гласове за: 12. НДСВ
  "party13_valid" integer,   -- 14) Действителни гласове за: 13. КП БЪЛГАРИЯ БЕЗ ЦЕНЗУРА
  "party13_invalid" integer, -- 14) Недействителни гласове за: 13. КП БЪЛГАРИЯ БЕЗ ЦЕНЗУРА
  "party14_valid" integer,   -- 15) Действителни гласове за: 14. Коалиция АБВ – (Алтернатива за българско възраждане)
  "party14_invalid" integer, -- 15) Недействителни гласове за: 14. Коалиция АБВ – (Алтернатива за българско възраждане)
  "party15_valid" integer,   -- 16) Действителни гласове за: 15. ЛЕВИЦАТА И ЗЕЛЕНА ПАРТИЯ
  "party15_invalid" integer, -- 16) Недействителни гласове за: 15. ЛЕВИЦАТА И ЗЕЛЕНА ПАРТИЯ
  "party16_valid" integer,   -- 17) Действителни гласове за: 16. НОВА АЛТЕРНАТИВА
  "party16_invalid" integer, -- 17) Недействителни гласове за: 16. НОВА АЛТЕРНАТИВА
  "party17_valid" integer,   -- 18) Действителни гласове за: 17. КП ДЕСНИТЕ
  "party17_invalid" integer, -- 18) Недействителни гласове за: 17. КП ДЕСНИТЕ
  "party18_valid" integer,   -- 19) Действителни гласове за: 18. ДПС – Движение за права и свободи
  "party18_invalid" integer, -- 19) Недействителни гласове за: 18. ДПС – Движение за права и свободи
  "party19_valid" integer,   -- 20) Действителни гласове за: 19. ПП Глас Народен
  "party19_invalid" integer, -- 20) Недействителни гласове за: 19. ПП Глас Народен
  "party20_valid" integer,   -- 21) Действителни гласове за: 20. ПАРТИЯ НА ЗЕЛЕНИТЕ
  "party20_invalid" integer, -- 21) Недействителни гласове за: 20. ПАРТИЯ НА ЗЕЛЕНИТЕ
  "party21_valid" integer,   -- 22) Действителни гласове за: 21. НОВА СИЛА
  "party21_invalid" integer, -- 22) Недействителни гласове за: 21. НОВА СИЛА
  "party22_valid" integer,   -- 23) Действителни гласове за: 22. БСП лява България
  "party22_invalid" integer, -- 23) Недействителни гласове за: 22. БСП лява България
  "party23_valid" integer,   -- 24) Действителни гласове за: 23. ЗЕЛЕНИТЕ
  "party23_invalid" integer, -- 24) Недействителни гласове за: 23. ЗЕЛЕНИТЕ
  "party24_valid" integer,   -- 25) Действителни гласове за: 24. ПАТРИОТИЧЕН ФРОНТ – НФСБ И ВМРО
  "party24_invalid" integer, -- 25) Недействителни гласове за: 24. ПАТРИОТИЧЕН ФРОНТ – НФСБ И ВМРО
  "party25_valid" integer,   -- 26) Действителни гласове за: 25. РЕПУБЛИКА БГ
  "party25_invalid" integer, -- 26) Недействителни гласове за: 25. РЕПУБЛИКА БГ
  "party26_valid" integer,   -- 27) За район 29. ХАСКОВО - Гласове за: 26. Господин Тончев Тонев
  "party26_invalid" integer, -- 27) За район 02. БУРГАС - Гласове за: 26. Ик Октай Хасанов Енимехмедов
                             -- 27) За район 01. БЛАГОЕВГРАД - Гласове за: 26. Инициативен Комитет Никола Николов Вапцаров
  "" text
);
