
create table _2015_mayor_1_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);
create table _2015_mayor_municipality_1_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);
create table _2015_mayor_region_1_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);
create table _2015_council_region_1_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);
create table _2015_mayor_2_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);
create table _2015_mayor_municipality_2_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);
create table _2015_mayor_region_2_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);

create table _2015_mayor_1_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);
create table _2015_mayor_municipality_1_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);
create table _2015_mayor_region_1_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);
create table _2015_council_region_1_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);
create table _2015_mayor_2_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);
create table _2015_mayor_municipality_2_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);
create table _2015_mayor_region_2_local_candidates(
  "region_id" integer,    -- 1) Код на ОИК
  "region_name" text,     -- 2) Наименование на Община/Кметство/Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "elected" text          -- 7) Флаг за избран кандидат(0-не е избран, 1-избран, 2-балотаж)
);

create table _2015_mayor_1_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);
create table _2015_mayor_municipality_1_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);
create table _2015_mayor_region_1_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);
create table _2015_council_region_1_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);
create table _2015_mayor_2_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);
create table _2015_mayor_municipality_2_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);
create table _2015_mayor_region_2_local_parties(
  "id" integer,       -- 1) Код на ОИК
  "region" text,      -- 2) Наименование на Община/Кметство/Район
  "party_id" integer, -- 3) Номер
  "party_name" text   -- 4) Име
);


create table _2015_mayor_1_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer     -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
);

create table _2015_mayor_municipality_1_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer     -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
);
create table _2015_mayor_region_1_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer     -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
);
create table _2015_council_region_1_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer,    -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
  "_1" text,
  "_2" text,
  "_3" text,
  "_4" text
);

create table _2015_mayor_2_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer     -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
);

create table _2015_mayor_municipality_2_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer     -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
);

create table _2015_mayor_region_2_cik_protocols(
  "form_number" integer,                  -- 1) № формуляр
  "section_id" text,                      -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                  -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,         -- 4) Серийни номера на страниците на протокола, разделени с |
  "number_of_candidates" integer,         -- 5)  А.Брой на регистрираните кандидатски листи на партии, коалиции, местни коалиции и независими кандидати
  "ballots_available" integer,            -- 6)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-МИ/Приложение № 79-МИ от изборните книжа
  "total_voters" integer,                 -- 7)  1.Брой на избирателите според избирателния/те списък/ци при предаването му/им на СИК (сумата от числата по букви „а“ и „б“ от тази точка)
  "list_1" integer,                       -- 8)1.а)Избирателен списък – част І
  "list_2" integer,                       -- 9)1.б)Избирателен списък – част ІІ
  "added_voters" integer,                 -- 10)  2.Брой на избирателите, вписани в допълнителната страница/и (под чертата) на избирателния/те списък/ци в изборния ден
  "voters_by_signature" integer,          -- 11)  3.Брой на гласувалите избиратели според положените подписи в избирателния/те списък/ци, включително и подписите в допълнителната/ите страница/и (под чертата)
  "ud40_a1" integer,                      -- 12)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 14-МИ от изборните книжа
  "number_of_declarations_added" integer, -- 13)4.б)декларации, подадени от лицата, вписани в допълнителната страница (под чертата) – Приложение № 15-МИ и Приложение № 74-МИ от изборните книжа
  "unused_ballots" integer,               -- 14)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,            -- 15)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,   -- 16)5.в)брой на недействителните бюлетини по чл. 427, ал. 6 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,        -- 17)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,       -- 18)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,      -- 19)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,               -- 20)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,       -- 21)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,         -- 22)  8.Брой намерени в избирателната кутия действителни гласове (бюлетини)
  "invalid_empty_or_onclear" integer     -- 23)  -.Празни бюлетини или бюлетини, в които е гласувано за повече от една листа, както и бюлетини, в които не може да се установи еднозначно вотът на избирателя
);


create table _2015_mayor_1_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_mayor_municipality_1_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_mayor_region_1_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_council_region_1_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_mayor_2_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_mayor_municipality_2_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_mayor_region_2_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" text,               -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2015_mayor_1_votes(
  "section_id" text,                 -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "district_id" text,                -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party1_invalid_ballots" integer,  -- недействителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party2_invalid_ballots" integer,  -- недействителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party3_invalid_ballots" integer,  -- недействителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party4_invalid_ballots" integer,  -- недействителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party5_invalid_ballots" integer,  -- недействителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party6_invalid_ballots" integer,  -- недействителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party7_invalid_ballots" integer,  -- недействителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party8_invalid_ballots" integer,  -- недействителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party9_invalid_ballots" integer,  -- недействителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party10_invalid_ballots" integer, -- недействителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer,   -- действителни гласове
  "party11_invalid_ballots" integer, -- недействителни гласове
  "party12_id" integer,              -- № П/К/ИК
  "party12_valid_ballots" integer,   -- действителни гласове
  "party12_invalid_ballots" integer -- недействителни гласове
);

create table _2015_mayor_municipality_1_votes(
  "section_id" text,                 -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "district_id" text,                -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party1_invalid_ballots" integer,  -- недействителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party2_invalid_ballots" integer,  -- недействителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party3_invalid_ballots" integer,  -- недействителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party4_invalid_ballots" integer,  -- недействителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party5_invalid_ballots" integer,  -- недействителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party6_invalid_ballots" integer,  -- недействителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party7_invalid_ballots" integer,  -- недействителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party8_invalid_ballots" integer,  -- недействителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party9_invalid_ballots" integer,  -- недействителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party10_invalid_ballots" integer, -- недействителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer,   -- действителни гласове
  "party11_invalid_ballots" integer, -- недействителни гласове
  "party12_id" integer,              -- № П/К/ИК
  "party12_valid_ballots" integer,   -- действителни гласове
  "party12_invalid_ballots" integer, -- недействителни гласове
  "party13_id" integer,              -- № П/К/ИК
  "party13_valid_ballots" integer,   -- действителни гласове
  "party13_invalid_ballots" integer, -- недействителни гласове
  "party14_id" integer,              -- № П/К/ИК
  "party14_valid_ballots" integer,   -- действителни гласове
  "party14_invalid_ballots" integer, -- недействителни гласове
  "party15_id" integer,              -- № П/К/ИК
  "party15_valid_ballots" integer,   -- действителни гласове
  "party15_invalid_ballots" integer, -- недействителни гласове
  "party16_id" integer,              -- № П/К/ИК
  "party16_valid_ballots" integer,   -- действителни гласове
  "party16_invalid_ballots" integer, -- недействителни гласове
  "party17_id" integer,              -- № П/К/ИК
  "party17_valid_ballots" integer,   -- действителни гласове
  "party17_invalid_ballots" integer, -- недействителни гласове
  "party18_id" integer,              -- № П/К/ИК
  "party18_valid_ballots" integer,   -- действителни гласове
  "party18_invalid_ballots" integer, -- недействителни гласове
  "party19_id" integer,              -- № П/К/ИК
  "party19_valid_ballots" integer,   -- действителни гласове
  "party19_invalid_ballots" integer, -- недействителни гласове
  "party20_id" integer,              -- № П/К/ИК
  "party20_valid_ballots" integer,   -- действителни гласове
  "party20_invalid_ballots" integer, -- недействителни гласове
  "party21_id" integer,              -- № П/К/ИК
  "party21_valid_ballots" integer,   -- действителни гласове
  "party21_invalid_ballots" integer  -- недействителни гласове
);

create table _2015_mayor_region_1_votes(
  "section_id" text,                 -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "district_id" text,                -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party1_invalid_ballots" integer,  -- недействителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party2_invalid_ballots" integer,  -- недействителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party3_invalid_ballots" integer,  -- недействителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party4_invalid_ballots" integer,  -- недействителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party5_invalid_ballots" integer,  -- недействителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party6_invalid_ballots" integer,  -- недействителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party7_invalid_ballots" integer,  -- недействителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party8_invalid_ballots" integer,  -- недействителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party9_invalid_ballots" integer,  -- недействителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party10_invalid_ballots" integer, -- недействителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer,   -- действителни гласове
  "party11_invalid_ballots" integer, -- недействителни гласове
  "party12_id" integer,              -- № П/К/ИК
  "party12_valid_ballots" integer,   -- действителни гласове
  "party12_invalid_ballots" integer, -- недействителни гласове
  "party13_id" integer,              -- № П/К/ИК
  "party13_valid_ballots" integer,   -- действителни гласове
  "party13_invalid_ballots" integer, -- недействителни гласове
  "party14_id" integer,              -- № П/К/ИК
  "party14_valid_ballots" integer,   -- действителни гласове
  "party14_invalid_ballots" integer, -- недействителни гласове
  "party15_id" integer,              -- № П/К/ИК
  "party15_valid_ballots" integer,   -- действителни гласове
  "party15_invalid_ballots" integer, -- недействителни гласове
  "party16_id" integer,              -- № П/К/ИК
  "party16_valid_ballots" integer,   -- действителни гласове
  "party16_invalid_ballots" integer, -- недействителни гласове
  "party17_id" integer,              -- № П/К/ИК
  "party17_valid_ballots" integer,   -- действителни гласове
  "party17_invalid_ballots" integer, -- недействителни гласове
  "party18_id" integer,              -- № П/К/ИК
  "party18_valid_ballots" integer,   -- действителни гласове
  "party18_invalid_ballots" integer, -- недействителни гласове
  "party19_id" integer,              -- № П/К/ИК
  "party19_valid_ballots" integer,   -- действителни гласове
  "party19_invalid_ballots" integer, -- недействителни гласове
  "party20_id" integer,              -- № П/К/ИК
  "party20_valid_ballots" integer,   -- действителни гласове
  "party20_invalid_ballots" integer, -- недействителни гласове
  "party21_id" integer,              -- № П/К/ИК
  "party21_valid_ballots" integer,   -- действителни гласове
  "party21_invalid_ballots" integer, -- недействителни гласове
  "party22_id" integer,              -- № П/К/ИК
  "party22_valid_ballots" integer,   -- действителни гласове
  "party22_invalid_ballots" integer, -- недействителни гласове
  "party23_id" integer,              -- № П/К/ИК
  "party23_valid_ballots" integer,   -- действителни гласове
  "party23_invalid_ballots" integer, -- недействителни гласове
  "party24_id" integer,              -- № П/К/ИК
  "party24_valid_ballots" integer,   -- действителни гласове
  "party24_invalid_ballots" integer, -- недействителни гласове
  "party25_id" integer,              -- № П/К/ИК
  "party25_valid_ballots" integer,   -- действителни гласове
  "party25_invalid_ballots" integer, -- недействителни гласове
  "party26_id" integer,              -- № П/К/ИК
  "party26_valid_ballots" integer,   -- действителни гласове
  "party26_invalid_ballots" integer  -- недействителни гласове
);

create table _2015_council_region_1_votes(
  "section_id" text,                 -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "district_id" text,                -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,               -- № П/К/ИК
  "party1_valid_ballots" integer,    -- действителни гласове
  "party1_invalid_ballots" integer,  -- недействителни гласове
  "party2_id" integer,               -- № П/К/ИК
  "party2_valid_ballots" integer,    -- действителни гласове
  "party2_invalid_ballots" integer,  -- недействителни гласове
  "party3_id" integer,               -- № П/К/ИК
  "party3_valid_ballots" integer,    -- действителни гласове
  "party3_invalid_ballots" integer,  -- недействителни гласове
  "party4_id" integer,               -- № П/К/ИК
  "party4_valid_ballots" integer,    -- действителни гласове
  "party4_invalid_ballots" integer,  -- недействителни гласове
  "party5_id" integer,               -- № П/К/ИК
  "party5_valid_ballots" integer,    -- действителни гласове
  "party5_invalid_ballots" integer,  -- недействителни гласове
  "party6_id" integer,               -- № П/К/ИК
  "party6_valid_ballots" integer,    -- действителни гласове
  "party6_invalid_ballots" integer,  -- недействителни гласове
  "party7_id" integer,               -- № П/К/ИК
  "party7_valid_ballots" integer,    -- действителни гласове
  "party7_invalid_ballots" integer,  -- недействителни гласове
  "party8_id" integer,               -- № П/К/ИК
  "party8_valid_ballots" integer,    -- действителни гласове
  "party8_invalid_ballots" integer,  -- недействителни гласове
  "party9_id" integer,               -- № П/К/ИК
  "party9_valid_ballots" integer,    -- действителни гласове
  "party9_invalid_ballots" integer,  -- недействителни гласове
  "party10_id" integer,              -- № П/К/ИК
  "party10_valid_ballots" integer,   -- действителни гласове
  "party10_invalid_ballots" integer, -- недействителни гласове
  "party11_id" integer,              -- № П/К/ИК
  "party11_valid_ballots" integer,   -- действителни гласове
  "party11_invalid_ballots" integer, -- недействителни гласове
  "party12_id" integer,              -- № П/К/ИК
  "party12_valid_ballots" integer,   -- действителни гласове
  "party12_invalid_ballots" integer, -- недействителни гласове
  "party13_id" integer,              -- № П/К/ИК
  "party13_valid_ballots" integer,   -- действителни гласове
  "party13_invalid_ballots" integer, -- недействителни гласове
  "party14_id" integer,              -- № П/К/ИК
  "party14_valid_ballots" integer,   -- действителни гласове
  "party14_invalid_ballots" integer, -- недействителни гласове
  "party15_id" integer,              -- № П/К/ИК
  "party15_valid_ballots" integer,   -- действителни гласове
  "party15_invalid_ballots" integer, -- недействителни гласове
  "party16_id" integer,              -- № П/К/ИК
  "party16_valid_ballots" integer,   -- действителни гласове
  "party16_invalid_ballots" integer, -- недействителни гласове
  "party17_id" integer,              -- № П/К/ИК
  "party17_valid_ballots" integer,   -- действителни гласове
  "party17_invalid_ballots" integer, -- недействителни гласове
  "party18_id" integer,              -- № П/К/ИК
  "party18_valid_ballots" integer,   -- действителни гласове
  "party18_invalid_ballots" integer, -- недействителни гласове
  "party19_id" integer,              -- № П/К/ИК
  "party19_valid_ballots" integer,   -- действителни гласове
  "party19_invalid_ballots" integer, -- недействителни гласове
  "party20_id" integer,              -- № П/К/ИК
  "party20_valid_ballots" integer,   -- действителни гласове
  "party20_invalid_ballots" integer, -- недействителни гласове
  "party21_id" integer,              -- № П/К/ИК
  "party21_valid_ballots" integer,   -- действителни гласове
  "party21_invalid_ballots" integer, -- недействителни гласове
  "party22_id" integer,              -- № П/К/ИК
  "party22_valid_ballots" integer,   -- действителни гласове
  "party22_invalid_ballots" integer, -- недействителни гласове
  "party23_id" integer,              -- № П/К/ИК
  "party23_valid_ballots" integer,   -- действителни гласове
  "party23_invalid_ballots" integer, -- недействителни гласове
  "party24_id" integer,              -- № П/К/ИК
  "party24_valid_ballots" integer,   -- действителни гласове
  "party24_invalid_ballots" integer, -- недействителни гласове
  "party25_id" integer,              -- № П/К/ИК
  "party25_valid_ballots" integer,   -- действителни гласове
  "party25_invalid_ballots" integer, -- недействителни гласове
  "party26_id" integer,              -- № П/К/ИК
  "party26_valid_ballots" integer,   -- действителни гласове
  "party26_invalid_ballots" integer, -- недействителни гласове
  "party27_id" integer,              -- № П/К/ИК
  "party27_valid_ballots" integer,   -- действителни гласове
  "party27_invalid_ballots" integer, -- недействителни гласове
  "party28_id" integer,              -- № П/К/ИК
  "party28_valid_ballots" integer,   -- действителни гласове
  "party28_invalid_ballots" integer, -- недействителни гласове
  "party29_id" integer,              -- № П/К/ИК
  "party29_valid_ballots" integer,   -- действителни гласове
  "party29_invalid_ballots" integer, -- недействителни гласове
  "party30_id" integer,              -- № П/К/ИК
  "party30_valid_ballots" integer,   -- действителни гласове
  "party30_invalid_ballots" integer, -- недействителни гласове
  "party31_id" integer,              -- № П/К/ИК
  "party31_valid_ballots" integer,   -- действителни гласове
  "party31_invalid_ballots" integer, -- недействителни гласове
  "party32_id" integer,              -- № П/К/ИК
  "party32_valid_ballots" integer,   -- действителни гласове
  "party32_invalid_ballots" integer -- недействителни гласове
);

create table _2015_mayor_2_votes(
  "section_id" text,                -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,               -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,              -- № П/К/ИК
  "party1_valid_ballots" integer,   -- действителни гласове
  "party1_invalid_ballots" integer, -- недействителни гласове
  "party2_id" integer,              -- № П/К/ИК
  "party2_valid_ballots" integer,   -- действителни гласове
  "party2_invalid_ballots" integer, -- недействителни гласове
  "party3_id" integer,              -- № П/К/ИК
  "party3_valid_ballots" integer,   -- действителни гласове
  "party3_invalid_ballots" integer  -- недействителни гласове
);

create table _2015_mayor_municipality_2_votes(
  "section_id" text,                -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,               -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,              -- № П/К/ИК
  "party1_valid_ballots" integer,   -- действителни гласове
  "party1_invalid_ballots" integer, -- недействителни гласове
  "party2_id" integer,              -- № П/К/ИК
  "party2_valid_ballots" integer,   -- действителни гласове
  "party2_invalid_ballots" integer  -- недействителни гласове
);

create table _2015_mayor_region_2_votes(
  "section_id" text,                -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" text,               -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,              -- № П/К/ИК
  "party1_valid_ballots" integer,   -- действителни гласове
  "party1_invalid_ballots" integer, -- недействителни гласове
  "party2_id" integer,              -- № П/К/ИК
  "party2_valid_ballots" integer,   -- действителни гласове
  "party2_invalid_ballots" integer  -- недействителни гласове
);
