CREATE TABLE _2013_parliament_candidates(
  "region_id" integer,    -- 1) Код на РИК
  "party_id" integer,     -- 2) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_id" integer, -- 3) Номер на кандидата в листата
  "candidate_name" text,  -- 4) Име на кандидата
  "party_name" text       -- 5) Име на партията/коалицията/инициативния комитет, издигнал кандидата
);

CREATE TABLE _2013_parliament_parties(
  "region_id" integer, -- 1) Код на РИК, попълва се само за инициативните комитети, издигащи независим кандидат
  "party_id" integer,  -- 2) Номер, под който е регистрирана партията/коалицията/инициативният комитет
  "party_name" text    -- 3) Наименование на партията/коалицията/инициативният комитет
);

CREATE TABLE _2013_parliament_protocols(
  "protocol_type" text,              -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,                 -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "parties_number" integer,          -- 3) За протоколите на Секционната избирателна комисия: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за народни представители.
                                     --   За протоколите на ДКП(РИК 32): Брой на избирателите, включени в избирателния списък при предаването му на СИК
  "ballots_available" integer,       -- 4) За протоколите на Секционната избирателна комисия: Брой на бюлетините, получени по реда на чл. 187, ал. 1 от ИК, вписани в т. 2 протокола по чл. 187, ал. 3 от ИК – Приложение № 80 от изборните книжа.
                                     --   За протоколите на ДКП(РИК 32): Брой на избирателите, вписани в изборния ден под чертата в избирателния списък 
  "total_voters" integer,            -- 5) За протоколите на Секционната избирателна комисия: Брой на избирателите според избирателния списък при предаването му на СИК.
                                     --   За протоколите на ДКП(РИК 32): Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите под чертата
  "added_voters" integer,            -- 6) За протоколите на Секционната избирателна комисия: Брой на избирателите, вписани в допълнителната страница (под чертата) За протоколите на Секционната избирателна комисия: на избирателния списък в изборния ден.
                                     --   За протоколите на ДКП(РИК 32): Декларации по чл. 44, ал. 5 от ИК (Приложение № 22 от изборните книжа)
  "added_voters_2" integer,          -- 7) За протоколите на Секционната избирателна комисия: Брой на избирателите, вписани в допълнителния избирателен списък в изборния ден.
                                     --   За протоколите на ДКП(РИК 32): Брой на намерените в избирателната урна бюлетини
  "voters_by_signature" integer,     -- 8) За протоколите на Секционната избирателна комисия: Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния избирателен списък.
                                     --   За протоколите на ДКП(РИК 32): бюлетини, които не са по установен образец
  "decl_194" integer,                -- 9) За протоколите на Секционната избирателна комисия: декларации по чл. 194 от ИК от лицата, заети в произвеждането на изборите като членове на СИК и охрана на съответната секция – Приложение № 72 от изборните книжа.
                                     --   За протоколите на ДКП(РИК 32): бюлетини върху които има изписани специални символи, като букви, цифри или други знаци)
  "decl_57" integer,                 -- 10) За протоколите на Секционната избирателна комисия: декларации по чл. 57 от ИК – Приложение № 73 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец, в които не е отразен със знак „Х“ и с химикал, пишещ със син цвят, вотът на избирателя
  "decl_48b" integer,                -- 11) За протоколите на Секционната избирателна комисия: удостоверения по чл. 48б, ал. 1 от ИК – Приложение № 14 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец, в които не отразен вотът на избирателя
  "decl_203" integer,                -- 12) За протоколите на Секционната избирателна комисия: декларации по чл. 203, ал. 3 от ИК – Приложение № 70 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец с отбелязан знак „Х“ или друг знак и с химикал, пишещ със син цвят или друг цвят, вот на избирателя за две или повече кандидатски листи
  "decl_207" integer,                -- 13) За протоколите на Секционната избирателна комисия: декларации по чл. 207, ал. 1, т. 3 от ИК - Приложение № 71 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец с отбелязан знак „Х“, който засяга повече от едно квадратче за гласуване и не може да се установи еднозначно волята на избирателя
  "voters_another_place" integer,    -- 14) За протоколите на Секционната избирателна комисия: удостоверения за гласуване на друго място (чл. 206 във връзка с чл. 49 от ИК) За протоколите на Секционната избирателна комисия: - Приложение № 18 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец, които не съдържат два броя печата на съответната секционна избирателна комисия
  "notes_count" integer,             -- 15) За протоколите на Секционната избирателна комисия: вписани в графа „Забележки“ в избирателния списък.
                                     --    За протоколите на ДКП(РИК 32): Недействителни гласове – сумата от числата по т. 9, букви „а“, „б“, „в“, „г“, „д“, „е“ и „ж“. 
  "added_guides" integer,            -- 16) За протоколите на Секционната избирателна комисия: вписани в Списъка за допълнително вписване на придружителите.
                                     --    За протоколите на ДКП(РИК 32): Брой на действителните гласове (броят на действителните гласове е равен на броя на бюлетините по установения образец, съдържащи два печата на гърба на съответната СИК, върху които вотът на избирателя е отбелязан със знак „Х“ с химикал, пишещ със син цвят, само в едно от квадратчетата за гласуване)
  "zast" integer,                    -- 17) брой застъпници, вписани в Списъка на застъпниците
  "party_people" integer,            -- 18) брой на представители на политическа партия, коалиция от партии и инициативен комитет, вписани в Списъка за вписване на представителите
  "observers" integer,               -- 19) брой на наблюдателите, вписани в Списъка за вписване на наблюдателите
  "unused_ballots" integer,          -- 20) брой на неизползваните бюлетини
  "destroyed_ballots" integer,       -- 21) брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "destroyed_ballots_180" integer,   -- 22) брой на недействителните бюлетини по чл. 180 от ИК 
  "destroyed_ballots_181" integer,   -- 23) брой на недействителните бюлетини по чл. 181 от ИК 
  "invalid_ballots_mistake" integer, -- 24) брой на сгрешените бюлетини по чл. 201, ал. 3 от ИК
  "ballots_in_box" integer,          -- 25) Брой на намерените в избирателната урна бюлетини
  "invalid_ballots" integer,         -- 26) бюлетини, които не са по установен образец
  "invalid_ballots_signs" integer,   -- 27) бюлетини върху които има изписани специални символи, като букви, цифри или други знаци)
  "invalid_ballots_no_x" integer,    -- 28) бюлетини по установен образец, в които не е отразен със знак „Х“ и с химикал, пишещ със син цвят, вотът на избирателя
  "empty_ballots" integer,           -- 29) бюлетини по установен образец, в които не отразен вотът на избирателя
  "multiple_choice" integer,         -- 30) бюлетини по установен образец с отбелязан знак „Х“ или друг знак и с химикал, пишещ със син цвят или друг цвят, вот на избирателя за две или повече кандидатски листи
  "invalid_out_of_the_box" integer,  -- 31) бюлетини по установен образец с отбелязан знак „Х“, който засяга повече от едно квадратче за гласуване и не може да се установи еднозначно волята на избирателя
  "innvalid_no_two_stamps" integer,  -- 32) бюлетини по установен образец, които не съдържат два броя печата на съответната секционна избирателна комисия
  "invalid_votes" integer,           -- 33) Недействителни гласове – сумата от числата по т. 11, букви „а“, „б“, „в“, „г“, „д“, „е“ и „ж“
  "total_invalid_votes" integer      -- 34) Брой на действителните гласове (броят на действителните гласове е равен на броя на бюлетините по установения образец, съдържащи два печата на гърба на съответната СИК, върху които вотът на избирателя е отбелязан със знак „Х“ с химикал, пишещ със син цвят, само в едно от квадратчетата за гласуване)
);

CREATE TABLE _2013_parliament_sections(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" text,        -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област(ако е чужбинска секция - държава)
  "municipality_name" text, -- 4) Име на община(ако е чужбинкса секция - празно)
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място(ако е чужбинска секция - празно)
);

CREATE TABLE _2013_parliament_votes(
  "section_type" integer,  -- 1) Знак, определящ вида на секционния протокол
  "section_id" text,       -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "party1_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party1_votes" integer,  -- Гласове за съответния РИК
  "party2_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party2_votes" integer,  -- Гласове за съответния РИК
  "party3_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party3_votes" integer,  -- Гласове за съответния РИК
  "party4_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party4_votes" integer,  -- Гласове за съответния РИК
  "party5_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party5_votes" integer,  -- Гласове за съответния РИК
  "party6_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party6_votes" integer,  -- Гласове за съответния РИК
  "party7_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party7_votes" integer,  -- Гласове за съответния РИК
  "party8_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party8_votes" integer,  -- Гласове за съответния РИК
  "party9_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party9_votes" integer,  -- Гласове за съответния РИК
  "party10_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party10_votes" integer, -- Гласове за съответния РИК
  "party11_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party11_votes" integer, -- Гласове за съответния РИК
  "party12_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party12_votes" integer, -- Гласове за съответния РИК
  "party13_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party13_votes" integer, -- Гласове за съответния РИК
  "party14_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party14_votes" integer, -- Гласове за съответния РИК
  "party15_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party15_votes" integer, -- Гласове за съответния РИК
  "party16_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party16_votes" integer, -- Гласове за съответния РИК
  "party17_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party17_votes" integer, -- Гласове за съответния РИК
  "party18_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party18_votes" integer, -- Гласове за съответния РИК
  "party19_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party19_votes" integer, -- Гласове за съответния РИК
  "party20_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party20_votes" integer, -- Гласове за съответния РИК
  "party21_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party21_votes" integer, -- Гласове за съответния РИК
  "party22_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party22_votes" integer, -- Гласове за съответния РИК
  "party23_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party23_votes" integer, -- Гласове за съответния РИК
  "party24_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party24_votes" integer, -- Гласове за съответния РИК
  "party25_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party25_votes" integer, -- Гласове за съответния РИК
  "party26_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party26_votes" integer, -- Гласове за съответния РИК
  "party27_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party27_votes" integer, -- Гласове за съответния РИК
  "party28_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party28_votes" integer, -- Гласове за съответния РИК
  "party29_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party29_votes" integer, -- Гласове за съответния РИК
  "party30_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party30_votes" integer, -- Гласове за съответния РИК
  "party31_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party31_votes" integer, -- Гласове за съответния РИК
  "party32_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party32_votes" integer, -- Гласове за съответния РИК
  "party33_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party33_votes" integer, -- Гласове за съответния РИК
  "party34_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party34_votes" integer, -- Гласове за съответния РИК
  "party35_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party35_votes" integer, -- Гласове за съответния РИК
  "party36_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party36_votes" integer, -- Гласове за съответния РИК
  "party37_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party37_votes" integer, -- Гласове за съответния РИК
  "party38_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party38_votes" integer, -- Гласове за съответния РИК
  "party39_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party39_votes" integer, -- Гласове за съответния РИК
  "party40_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party40_votes" integer, -- Гласове за съответния РИК
  "party41_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party41_votes" integer, -- Гласове за съответния РИК
  "party42_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party42_votes" integer, -- Гласове за съответния РИК
  "party43_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party43_votes" integer, -- Гласове за съответния РИК
  "party44_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party44_votes" integer, -- Гласове за съответния РИК
  "party45_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party45_votes" integer, -- Гласове за съответния РИК
  "party46_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party46_votes" integer  -- Гласове за съответния РИК
);
