-- -------------------------------------------------------------
-- TablePlus 3.7.1(332)
--
-- https://tableplus.com/
--
-- Database: all_elections.db
-- Generation Time: 2020-08-15 12:47:21.2670
-- -------------------------------------------------------------


CREATE TABLE parliament_candidates_2013(
  "region_id" integer,    -- 1) Код на РИК
  "party_id" integer,     -- 2) Номер на партията/коалицията/инициативния комитет, издигнал кандидата
  "candidate_id" integer, -- 3) Номер на кандидата в листата
  "candidate_name" text,  -- 4) Име на кандидата
  "party_name" text       -- 5) Име на партията/коалицията/инициативния комитет, издигнал кандидата
);

CREATE TABLE parliament_candidates_2014(
  "region_id" integer,    -- 1) Номер на РИК
  "party_id" integer,     -- 2) Номер на партия/коалиция/инициативен комитет
  "party_name" integer,   -- 3) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 4) Номер на кандидат в листата
  "candidate_name" text   -- 5) Име на кандидат
);

CREATE TABLE parliament_cik_parties_2017(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име  
);

CREATE TABLE parliament_ind_2014(
  "region_id" integer,  -- Регион
  "party_id" integer,   -- Номер на кандидата в листата
  "candidate_name" text -- Име на кандидата
);

CREATE TABLE parliament_local_candidates_2017(
  "region_id" integer,    -- 1) Код на РИК
  "region_name" text,     -- 2) Наименование на Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "" text
);

CREATE TABLE parliament_local_parties_2017(
  "id" integer,       -- 1) Код на РИК
  "region" text,      -- 2) Наименование на Район
  "party_id" integer, -- 3) Номер на партия
  "party_name" text   -- 4) Име
);

CREATE TABLE parliament_majorvotes_2009(
  "section_id" text,       -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "major1_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major2_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major3_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major4_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major5_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major6_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major7_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major8_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major9_valid" integer,  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major10_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major11_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major12_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major13_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major14_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major15_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major16_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major17_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major18_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major19_valid" integer, -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
  "major20_valid" integer  -- Гласовете за мажоритарни кандидати за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидат в съответния район се вписва празна стойност.
);

CREATE TABLE parliament_parties_2013(
  "region_id" integer, -- 1) Код на РИК, попълва се само за инициативните комитети, издигащи независим кандидат
  "party_id" integer,  -- 2) Номер, под който е регистрирана партията/коалицията/инициативният комитет
  "party_name" text    -- 3) Наименование на партията/коалицията/инициативният комитет
);

CREATE TABLE parliament_parties_2014(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);

CREATE TABLE parliament_partyvotes_2009(
  "section_id" text,       -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "party1_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party2_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party3_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party4_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party5_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party6_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party7_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party8_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party9_valid" integer,  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party10_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party11_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party12_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party13_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party14_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party15_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party16_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party17_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party18_valid" integer, -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
  "party19_valid" integer  -- Гласовете за партии за съответния район, подредени по техния пореден номер. За партиите, които не издигат кандидатски листи в съответния район се вписва празна стойност.
);

CREATE TABLE parliament_preferences_2014(
  "section_id" integer,   -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,     -- 2) Номер на партия
  "candidate_id" integer, -- 3) Номер на кандидат в кандидатска листа (0 - за поле "без")
  "votes" integer         -- 4) Брой гласове
);

CREATE TABLE parliament_preferences_2017(
  "section_id" integer,     -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,       -- 2) Номер на партия
  "valid_ballots" integer,  -- 3) Номер на кандидат в кандидатска листа
  "invalid_ballots" integer -- 4) Брой гласове
);

CREATE TABLE parliament_protocols_2009(
  "section_id" integer,                          -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "total_voters" integer,                        -- 2) (т.1) Брой на избирателите в основния и допълнителния избирателен списък (т. 1 = т. 2 + т. 3 + т. 4)
  "total_voters_in_section" integer,             -- 3) (т.2) Брой на избирателите в основния избирателен списък (равен на броя на избирателите в избирателния списък и в списъка за гласуване с подвижна избирателна кутия (когато има такъв) при предаването му на СИК) 
  "added_on_elections_day" integer,              -- 4) (т.3) Брой на избирателите, вписани от СИК в допълнителната страница на основния избирателен списък в изборния ден
  "added_voters" integer,                        -- 5) (т.4) Брой на избирателите в допълнителния избирателен списък (т. 4 = т. 5 + т. 6 + т. 7)
  "vote_another_place_count" integer,            -- 6) (т.5) Брой на удостоверенията за гласуване на друго място
  "student_declaration_count" integer,           -- 7) (т.6) Брой на декларациите на ученици и студенти по чл. 36, ал. 11 от ЗИНП
  "voters_with_eye_problems_count" integer,      -- 8) (т.7) Брой на декларациите на избиратели с физически или зрителни увреждания по чл. 88а, ал. 3 от ЗИНП
  "decl84a" integer,                             -- 9) (т.8) Брой на декларациите на служебно заети лица по чл. 84а от ЗИНП
  "voters_by_signature" integer,                 -- 10) (т.9) Брой на гласувалите избиратели според подписите в избирателните списъци (основен и допълнителен)
  "machine_vote_count" integer,                  -- 11) (т.10) Брой избиратели гласували по електронен път според отбелязванията в графа „Забележки” на избирателния списък <b>(попълва се от СИК, в която се провежда електронно гласуване, останалите СИК вписват нула)</b>
  "major_ballots_in_box" integer,                -- 12) (т.11) Брой на намерените в избирателните кутии бюлетини за мажоритарни кандидати
  "invalid_major_ballots" integer,               -- 13) (т.12) Брой на намерените бюлетини за мажоритарни кандидати, които не са по установения образец
  "invalid_major_count_special_symbols" integer, -- 14) (т.13) Брой на намерените бюлетини за мажоритарни кандидати с вписани в тях специални символи като букви и числа, позволяващи да се разкрие самоличността на избирателя
  "empty_major_ballots" integer,                 -- 15) (т.14) Брой на намерените бюлетини за мажоритарни кандидати по установения образец, в които не е отразен вотът на избирателя  и които съдържат два печата на СИК
  "major_ballots_multiple_choice" integer,       -- 16) (т.15) Брой на намерените бюлетини за мажоритарни кандидати по установения образец, с отбелязан вот за двама или повече кандидати и които съдържат два печата на СИК
  "major_ballots_without_stamp" integer,         -- 17) (т.16) Брой на намерените бюлетини за мажоритарни кандидати, които не съдържат два печата на СИК
  "total_ballots_in_box" integer,                -- 18) (т.17) Брой на недействителните гласове за мажоритарни кандидати (т. 17 = т. 12 + т. 13 + т. 14 + т. 15 + т. 16)
  "total_major_invalid_ballots" integer,         -- 19) (т.18) Брой на намерените бюлетини за мажоритарни кандидати по установения образец с отбелязан вот за един кандидат и които съдържат два печата на СИК (брой на действителните гласове за мажоритарни кандидати)
  "ballots_with_special_symbols" integer,        -- 20) (т.20) Брой на намерените в избирателните кутии бюлетини за кандидатски листи
  "empty_ballots" integer,                       -- 21) (т.21) Брой на намерените бюлетини за кандидатски листи, които не са по установения образец
  "invalid_ballots_multiple_choice" integer,     -- 22) (т.22) Брой на намерените бюлетини за кандидатски листи с вписани в тях специални символи като букви и числа, позволяващи да се разкрие самоличността на избирателя
  "ballots_without_two_stamps" integer,          -- 23) (т.23) Брой на намерените бюлетини за кандидатски листи по установения образец, в които не е отразен вотът на избирателя и които съдържат два печата на СИК
  "invalid_ballots" integer,                     -- 24) (т.24) Брой на намерените бюлетини за кандидатски листи по установения образец, с отбелязан вот за двама или повече кандидати и които съдържат два печата на СИК
  "invalid_ballots_no_stamps_count" integer,     -- 25) (т.25) Брой на намерените бюлетини за кандидатски листи, които не съдържат два печата на СИК
  "total_invalid_ballots" integer,               -- 26) (т.26) Брой на недействителните гласове за кандидатски листи (т. 26 = т. 21 + т. 22 + т. 23 + т. 24 + т. 25)
  "total_valid_ballots" integer,                 -- 27) (т.27) Брой на намерените бюлетини за кандидатски листи по установения образец с отбелязан вот за една кандидатска листа и които съдържат два печата на СИК (брой на действителните гласове за кандидатски листи)
  "total_invalid_881011" integer                 -- 28) (т.29) Брой на недействителните бюлетини по чл. 88, ал. 10 и 11 от ЗИНП 
);

CREATE TABLE parliament_protocols_2013(
  "protocol_type" text,              -- 1) Знак, определящ вида на секционния протокол
  "section_id" integer,              -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3));
  "parties_number" integer,          -- 3) За протоколите на Секционната избирателна комисия: Брой на регистрираните кандидатски листи на партии, коалиции от партии и независими кандидати за народни представители.
                                     --   За протоколите на ДКП(РИК 32): Брой на избирателите, включени в избирателния списък при предаването му на СИК
  "ballots_available" integer,       -- 4) За протоколите на Секционната избирателна комисия: Брой на бюлетините, получени по реда на чл. 187, ал. 1 от ИК, вписани в т. 2 протокола по чл. 187, ал. 3 от ИК – Приложение № 80 от изборните книжа.
                                     --   За протоколите на ДКП(РИК 32): Брой на избирателите, вписани в изборния ден под чертата в избирателния списък 
  "total_voters" integer,            -- 5) За протоколите на Секционната избирателна комисия: Брой на избирателите според избирателния списък при предаването му на СИК.
                                     --   За протоколите на ДКП(РИК 32): Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите под чертата
  "added_voters" integer,            -- 6) За протоколите на Секционната избирателна комисия: Брой на избирателите, вписани в допълнителната страница (под чертата) За протоколите на Секционната избирателна комисия: на избирателния списък в изборния ден.
                                     --   За протоколите на ДКП(РИК 32): Декларации по чл. 44, ал. 5 от ИК (Приложение № 22 от изборните книжа)
  "added_voters_2" integer,          -- 7) За протоколите на Секционната избирателна комисия: Брой на избирателите, вписани в допълнителния избирателен списък в изборния ден.
                                     --   За протоколите на ДКП(РИК 32): Брой на намерените в избирателната урна бюлетини
  "voters_by_signature" integer,     -- 8) За протоколите на Секционната избирателна комисия: Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница (под чертата), както и тези от допълнителния избирателен списък.
                                     --   За протоколите на ДКП(РИК 32): бюлетини, които не са по установен образец
  "decl_194" integer,                -- 9) За протоколите на Секционната избирателна комисия: декларации по чл. 194 от ИК от лицата, заети в произвеждането на изборите като членове на СИК и охрана на съответната секция – Приложение № 72 от изборните книжа.
                                     --   За протоколите на ДКП(РИК 32): бюлетини върху които има изписани специални символи, като букви, цифри или други знаци)
  "decl_57" integer,                 -- 10) За протоколите на Секционната избирателна комисия: декларации по чл. 57 от ИК – Приложение № 73 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец, в които не е отразен със знак „Х“ и с химикал, пишещ със син цвят, вотът на избирателя
  "decl_48b" integer,                -- 11) За протоколите на Секционната избирателна комисия: удостоверения по чл. 48б, ал. 1 от ИК – Приложение № 14 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец, в които не отразен вотът на избирателя
  "decl_203" integer,                -- 12) За протоколите на Секционната избирателна комисия: декларации по чл. 203, ал. 3 от ИК – Приложение № 70 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец с отбелязан знак „Х“ или друг знак и с химикал, пишещ със син цвят или друг цвят, вот на избирателя за две или повече кандидатски листи
  "decl_207" integer,                -- 13) За протоколите на Секционната избирателна комисия: декларации по чл. 207, ал. 1, т. 3 от ИК - Приложение № 71 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец с отбелязан знак „Х“, който засяга повече от едно квадратче за гласуване и не може да се установи еднозначно волята на избирателя
  "voters_another_place" integer,    -- 14) За протоколите на Секционната избирателна комисия: удостоверения за гласуване на друго място (чл. 206 във връзка с чл. 49 от ИК) За протоколите на Секционната избирателна комисия: - Приложение № 18 от изборните книжа.
                                     --    За протоколите на ДКП(РИК 32): бюлетини по установен образец, които не съдържат два броя печата на съответната секционна избирателна комисия
  "notes_count" integer,             -- 15) За протоколите на Секционната избирателна комисия: вписани в графа „Забележки“ в избирателния списък.
                                     --    За протоколите на ДКП(РИК 32): Недействителни гласове – сумата от числата по т. 9, букви „а“, „б“, „в“, „г“, „д“, „е“ и „ж“. 
  "added_guides" integer,            -- 16) За протоколите на Секционната избирателна комисия: вписани в Списъка за допълнително вписване на придружителите.
                                     --    За протоколите на ДКП(РИК 32): Брой на действителните гласове (броят на действителните гласове е равен на броя на бюлетините по установения образец, съдържащи два печата на гърба на съответната СИК, върху които вотът на избирателя е отбелязан със знак „Х“ с химикал, пишещ със син цвят, само в едно от квадратчетата за гласуване)
  "zast" integer,                    -- 17) брой застъпници, вписани в Списъка на застъпниците
  "party_people" integer,            -- 18) брой на представители на политическа партия, коалиция от партии и инициативен комитет, вписани в Списъка за вписване на представителите
  "observers" integer,               -- 19) брой на наблюдателите, вписани в Списъка за вписване на наблюдателите
  "unused_ballots" integer,          -- 20) брой на неизползваните бюлетини
  "destroyed_ballots" integer,       -- 21) брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "destroyed_ballots_180" integer,   -- 22) брой на недействителните бюлетини по чл. 180 от ИК 
  "destroyed_ballots_181" integer,   -- 23) брой на недействителните бюлетини по чл. 181 от ИК 
  "invalid_ballots_mistake" integer, -- 24) брой на сгрешените бюлетини по чл. 201, ал. 3 от ИК
  "invalid_ballots_201" integer,     -- 25) Брой на намерените в избирателната урна бюлетини
  "ballots_in_box" integer,          -- 26) бюлетини, които не са по установен образец
  "invalid_ballots" integer,         -- 27) бюлетини върху които има изписани специални символи, като букви, цифри или други знаци)
  "invalid_ballots_signs" integer,   -- 28) бюлетини по установен образец, в които не е отразен със знак „Х“ и с химикал, пишещ със син цвят, вотът на избирателя
  "empty_ballots" integer,           -- 29) бюлетини по установен образец, в които не отразен вотът на избирателя
  "multiple_choice" integer,         -- 30) бюлетини по установен образец с отбелязан знак „Х“ или друг знак и с химикал, пишещ със син цвят или друг цвят, вот на избирателя за две или повече кандидатски листи
  "invalid_out_of_the_box" integer,  -- 31) бюлетини по установен образец с отбелязан знак „Х“, който засяга повече от едно квадратче за гласуване и не може да се установи еднозначно волята на избирателя
  "innvalid_no_two_stamps" integer,  -- 32) бюлетини по установен образец, които не съдържат два броя печата на съответната секционна избирателна комисия
  "invalid_votes" integer,           -- 33) Недействителни гласове – сумата от числата по т. 11, букви „а“, „б“, „в“, „г“, „д“, „е“ и „ж“
  "total_invalid_votes" integer      -- 34) Брой на действителните гласове (броят на действителните гласове е равен на броя на бюлетините по установения образец, съдържащи два печата на гърба на съответната СИК, върху които вотът на избирателя е отбелязан със знак „Х“ с химикал, пишещ със син цвят, само в едно от квадратчетата за гласуване)
);

CREATE TABLE parliament_protocols_2014(
  "section_id" integer,                       -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "number_of_candidates" integer,             -- 2)  А.Брой на регистрираните кандидатски листи на партии, коалиции и независими кандидати за народни представители
  "ballots_available" integer,                -- 3)  Б.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК, вписани в т. 4 протокола по чл. 215, ал. 4 от ИК – Приложение № 77-НС от изборните книжа
  "total_voters" integer,                     -- 4)  1.Брой на избирателите според избирателния списък при предаването му на СИК
  "added_voters" integer,                     -- 5)  2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
  "voters_by_signature" integer,              -- 6)  3.Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница(под чертата)
  "ud40al1" integer,                          -- 7)4.a)удостоверения по чл. 40, ал. 1 от ИК – Приложение № 18-НС от изборните книжа
  "ud_vote_other_place" integer,              -- 8)4.б)удостоверения за гласуване на друго място – Приложение № 20-НС от изборните книжа
  "declaration_added_voters" integer,         -- 9)4.в)декларации, подадени от лицата, вписани в допълнителната страница (под чертата)
  "unused_ballots" integer,                   -- 10)5.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,                -- 11)5.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer,       -- 12)5.в)брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,            -- 13)5.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,           -- 14)5.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,          -- 15)5.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,                   -- 16)  6.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots" integer,                  -- 17)  7.Брой намерени в избирателната кутия недействителни гласове (бюлетини) 
  "valid_ballots" integer,                    -- 18)  8.Брой намерени в избирателната кутия действителните гласове (бюлетини)
  "invalid_empty_or_multiple_choice" integer, -- 19)Празни бюлетини или бюлетини, в които е гласувано за повече от една листа
  "serial_numbers" integer                    -- 20) Серийни номера на страници на протокол, разделени с |
);

CREATE TABLE parliament_protocols_2017(
  "form_number" integer,                -- 1) № формуляр
  "section_id" text,                    -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,       -- 4) Серийни номера на страниците на протокола, разделени с |
  "ballots_available" integer,          -- 5)  Формуляр № 1: А.Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 от ИК
                                        --     Формуляр № 7: А.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК
  "total_voters" integer,               -- 6)  Формуляр № 1: 1.Брой на избирателите според избирателния списък при предаването му на СИК
                                        --     Формуляр № 7: 1.Брой избиратели според списъка за гласуване извън страната преди предаването му на СИК
  "added_voters" integer,               -- 7)  Формуляр № 1: 2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
                                        --     Формуляр № 7: 2.Брой на избирателите, вписани в избирателния списък в изборния ден (под чертата)
  "voters_by_signature" integer,        -- 8)  Формуляр № 1: 3.Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница(под чертата)
                                        --     Формуляр № 7: 3.Брой на гласувалите избиратели според положените подписи в избирателния списък
  "unused_ballots" integer,             -- 9) Формуляр № 1: 4.а)брой на неизползваните бюлетини
                                        --    Формуляр № 7: 4.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,          -- 10)4.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer, -- 11) Формуляр № 1: 4.в)брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
                                        --     Формуляр № 7: 4.в)бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,      -- 12)4.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,     -- 13)4.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,    -- 14)4.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,             -- 15)  5.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,     -- 16)  6.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,       -- 17) Формуляр № 1: 7.Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
                                        --     Формуляр № 7: 7.Общ брой намерени в избирателната кутия действителните гласове (бюлетини)
  "valid_ballots_for_party" integer,    -- 18) Формуляр № 1: 7.1брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети 
                                        --     Формуляр № 7: 7.1брой на действителните гласове, подадени за кандидатски листи на партии и коалиции
  "valid_no_one_all" integer,           -- 19) 7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
  "invalid_empty_or_onclear" integer   -- 20)  9.Празни бюлетини; бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
);

CREATE TABLE parliament_sections_2009(
  "section_id" integer, -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "location_name" text, -- 2) Име на Населено място
  "ekatte" integer,     -- 3) ЕКАТТЕ на населеното място
  "" text
);

CREATE TABLE parliament_sections_2013(
  "section_type" text,      -- 1) Знак, определящ вида на секцията
  "section_id" integer,     -- 2) Пълен код на секция(код на област(2), община(2), адм. район(2), секция(3))
  "district_name" text,     -- 3) Име на област(ако е чужбинска секция - държава)
  "municipality_name" text, -- 4) Име на община(ако е чужбинкса секция - празно)
  "location_name" text,     -- 5) Име на населено място
  "ekatte" integer          -- 6) ЕКАТТЕ на населеното място(ако е чужбинска секция - празно)
);

CREATE TABLE parliament_sections_2014(
  "section_id" integer,     -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "location_name" text,     -- 2) Име на Населено място
  "ekatte" integer,         -- 3) ЕКАТТЕ на населеното място
  "mobile_section" boolean, -- 4) Флаг мобилна секция
  "ship_section" boolean,   -- 5) Флаг корабна секция
  "machine_section" boolean -- 6) Флаг машинно гласуване
);

CREATE TABLE parliament_sections_2017(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" integer,            -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean       -- 7) Флаг корабна секция
);

CREATE TABLE parliament_votes_2013(
  "section_type" integer,  -- 1) Знак, определящ вида на секционния протокол
  "party1_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party1_votes" integer,  -- Гласове за съответния РИК
  "party2_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party2_votes" integer,  -- Гласове за съответния РИК
  "party3_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party3_votes" integer,  -- Гласове за съответния РИК
  "party4_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party4_votes" integer,  -- Гласове за съответния РИК
  "party5_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party5_votes" integer,  -- Гласове за съответния РИК
  "party6_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party6_votes" integer,  -- Гласове за съответния РИК
  "party7_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party7_votes" integer,  -- Гласове за съответния РИК
  "party8_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party8_votes" integer,  -- Гласове за съответния РИК
  "party9_id" integer,     -- Номер на партия/коалиция/независим кандидат
  "party9_votes" integer,  -- Гласове за съответния РИК
  "party10_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party10_votes" integer, -- Гласове за съответния РИК
  "party11_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party11_votes" integer, -- Гласове за съответния РИК
  "party12_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party12_votes" integer, -- Гласове за съответния РИК
  "party13_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party13_votes" integer, -- Гласове за съответния РИК
  "party14_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party14_votes" integer, -- Гласове за съответния РИК
  "party15_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party15_votes" integer, -- Гласове за съответния РИК
  "party16_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party16_votes" integer, -- Гласове за съответния РИК
  "party17_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party17_votes" integer, -- Гласове за съответния РИК
  "party18_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party18_votes" integer, -- Гласове за съответния РИК
  "party19_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party19_votes" integer, -- Гласове за съответния РИК
  "party20_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party20_votes" integer, -- Гласове за съответния РИК
  "party21_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party21_votes" integer, -- Гласове за съответния РИК
  "party22_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party22_votes" integer, -- Гласове за съответния РИК
  "party23_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party23_votes" integer, -- Гласове за съответния РИК
  "party24_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party24_votes" integer, -- Гласове за съответния РИК
  "party25_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party25_votes" integer, -- Гласове за съответния РИК
  "party26_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party26_votes" integer, -- Гласове за съответния РИК
  "party27_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party27_votes" integer, -- Гласове за съответния РИК
  "party28_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party28_votes" integer, -- Гласове за съответния РИК
  "party29_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party29_votes" integer, -- Гласове за съответния РИК
  "party30_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party30_votes" integer, -- Гласове за съответния РИК
  "party31_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party31_votes" integer, -- Гласове за съответния РИК
  "party32_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party32_votes" integer, -- Гласове за съответния РИК
  "party33_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party33_votes" integer, -- Гласове за съответния РИК
  "party34_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party34_votes" integer, -- Гласове за съответния РИК
  "party35_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party35_votes" integer, -- Гласове за съответния РИК
  "party36_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party36_votes" integer, -- Гласове за съответния РИК
  "party37_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party37_votes" integer, -- Гласове за съответния РИК
  "party38_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party38_votes" integer, -- Гласове за съответния РИК
  "party39_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party39_votes" integer, -- Гласове за съответния РИК
  "party40_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party40_votes" integer, -- Гласове за съответния РИК
  "party41_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party41_votes" integer, -- Гласове за съответния РИК
  "party42_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party42_votes" integer, -- Гласове за съответния РИК
  "party43_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party43_votes" integer, -- Гласове за съответния РИК
  "party44_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party44_votes" integer, -- Гласове за съответния РИК
  "party45_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party45_votes" integer, -- Гласове за съответния РИК
  "party46_id" integer,    -- Номер на партия/коалиция/независим кандидат
  "party46_votes" integer  -- Гласове за съответния РИК
);

CREATE TABLE parliament_votes_2014(
  "section_id" text,         -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "party1_valid" integer,    -- 2) Действителни гласове за:  1. Движение 21
  "party1_invalid" integer,  -- 2) Недействителни гласове за:  1. Движение 21
  "party2_valid" integer,    -- 3) Действителни гласове за:  2. БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ
  "party2_invalid" integer,  -- 3) Недействителни гласове за:  2. БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ
  "party3_valid" integer,    -- 4) Действителни гласове за:  3. БЪЛГАРСКИ НАЦИОНАЛЕН СЪЮЗ - НД
  "party3_invalid" integer,  -- 4) Недействителни гласове за:  3. БЪЛГАРСКИ НАЦИОНАЛЕН СЪЮЗ - НД
  "party4_valid" integer,    -- 5) Действителни гласове за:  4. ПП НОВОТО ВРЕМЕ
  "party4_invalid" integer,  -- 5) Недействителни гласове за:  4. ПП НОВОТО ВРЕМЕ
  "party5_valid" integer,    -- 6) Действителни гласове за:  5. ОБЕДИНЕНА БЪЛГАРИЯ
  "party5_invalid" integer,  -- 6) Недействителни гласове за:  5. ОБЕДИНЕНА БЪЛГАРИЯ
  "party6_valid" integer,    -- 7) Действителни гласове за:  6. СОЦИАЛДЕМОКРАТИЧЕСКА ПАРТИЯ
  "party6_invalid" integer,  -- 7) Недействителни гласове за:  6. СОЦИАЛДЕМОКРАТИЧЕСКА ПАРТИЯ
  "party7_valid" integer,    -- 8) Действителни гласове за:  7. РЕФОРМАТОРСКИ БЛОК – БЗНС, ДБГ, ДСБ, НПСД, СДС
  "party7_invalid" integer,  -- 8) Недействителни гласове за:  7. РЕФОРМАТОРСКИ БЛОК – БЗНС, ДБГ, ДСБ, НПСД, СДС
  "party8_valid" integer,    -- 9) Действителни гласове за:  8. ПП Нова България
  "party8_invalid" integer,  -- 9) Недействителни гласове за:  8. ПП Нова България
  "party9_valid" integer,    -- 10) Действителни гласове за:  9. ПП ГЕРБ
  "party9_invalid" integer,  -- 10) Недействителни гласове за:  9. ПП ГЕРБ
  "party10_valid" integer,   -- 11) Действителни гласове за: 10. ОБЩЕСТВО ЗА НОВА БЪЛГАРИЯ
  "party10_invalid" integer, -- 11) Недействителни гласове за: 10. ОБЩЕСТВО ЗА НОВА БЪЛГАРИЯ
  "party11_valid" integer,   -- 12) Действителни гласове за: 11. АТАКА
  "party11_invalid" integer, -- 12) Недействителни гласове за: 11. АТАКА
  "party12_valid" integer,   -- 13) Действителни гласове за: 12. НДСВ
  "party12_invalid" integer, -- 13) Недействителни гласове за: 12. НДСВ
  "party13_valid" integer,   -- 14) Действителни гласове за: 13. КП БЪЛГАРИЯ БЕЗ ЦЕНЗУРА
  "party13_invalid" integer, -- 14) Недействителни гласове за: 13. КП БЪЛГАРИЯ БЕЗ ЦЕНЗУРА
  "party14_valid" integer,   -- 15) Действителни гласове за: 14. Коалиция АБВ – (Алтернатива за българско възраждане)
  "party14_invalid" integer, -- 15) Недействителни гласове за: 14. Коалиция АБВ – (Алтернатива за българско възраждане)
  "party15_valid" integer,   -- 16) Действителни гласове за: 15. ЛЕВИЦАТА И ЗЕЛЕНА ПАРТИЯ
  "party15_invalid" integer, -- 16) Недействителни гласове за: 15. ЛЕВИЦАТА И ЗЕЛЕНА ПАРТИЯ
  "party16_valid" integer,   -- 17) Действителни гласове за: 16. НОВА АЛТЕРНАТИВА
  "party16_invalid" integer, -- 17) Недействителни гласове за: 16. НОВА АЛТЕРНАТИВА
  "party17_valid" integer,   -- 18) Действителни гласове за: 17. КП ДЕСНИТЕ
  "party17_invalid" integer, -- 18) Недействителни гласове за: 17. КП ДЕСНИТЕ
  "party18_valid" integer,   -- 19) Действителни гласове за: 18. ДПС – Движение за права и свободи
  "party18_invalid" integer, -- 19) Недействителни гласове за: 18. ДПС – Движение за права и свободи
  "party19_valid" integer,   -- 20) Действителни гласове за: 19. ПП Глас Народен
  "party19_invalid" integer, -- 20) Недействителни гласове за: 19. ПП Глас Народен
  "party20_valid" integer,   -- 21) Действителни гласове за: 20. ПАРТИЯ НА ЗЕЛЕНИТЕ
  "party20_invalid" integer, -- 21) Недействителни гласове за: 20. ПАРТИЯ НА ЗЕЛЕНИТЕ
  "party21_valid" integer,   -- 22) Действителни гласове за: 21. НОВА СИЛА
  "party21_invalid" integer, -- 22) Недействителни гласове за: 21. НОВА СИЛА
  "party22_valid" integer,   -- 23) Действителни гласове за: 22. БСП лява България
  "party22_invalid" integer, -- 23) Недействителни гласове за: 22. БСП лява България
  "party23_valid" integer,   -- 24) Действителни гласове за: 23. ЗЕЛЕНИТЕ
  "party23_invalid" integer, -- 24) Недействителни гласове за: 23. ЗЕЛЕНИТЕ
  "party24_valid" integer,   -- 25) Действителни гласове за: 24. ПАТРИОТИЧЕН ФРОНТ – НФСБ И ВМРО
  "party24_invalid" integer, -- 25) Недействителни гласове за: 24. ПАТРИОТИЧЕН ФРОНТ – НФСБ И ВМРО
  "party25_valid" integer,   -- 26) Действителни гласове за: 25. РЕПУБЛИКА БГ
  "party25_invalid" integer, -- 26) Недействителни гласове за: 25. РЕПУБЛИКА БГ
  "party26_valid" integer,   -- 27) За район 29. ХАСКОВО - Гласове за: 26. Господин Тончев Тонев
  "party26_invalid" integer  -- 27) За район 02. БУРГАС - Гласове за: 26. Ик Октай Хасанов Енимехмедов
                             -- 27) За район 01. БЛАГОЕВГРАД - Гласове за: 26. Инициативен Комитет Никола Николов Вапцаров
);

CREATE TABLE parliament_votes_2017(
  "section_id" text,         -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "region_id" integer,       -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,       -- № П/К/ИК
  "party1_valid" integer,    -- Действителни гласове
  "party1_invalid" integer,  -- Недействителни гласове
  "party2_id" integer,       -- № П/К/ИК
  "party2_valid" integer,    -- Действителни гласове
  "party2_invalid" integer,  -- Недействителни гласове
  "party3_id" integer,       -- № П/К/ИК
  "party3_valid" integer,    -- Действителни гласове
  "party3_invalid" integer,  -- Недействителни гласове
  "party4_id" integer,       -- № П/К/ИК
  "party4_valid" integer,    -- Действителни гласове
  "party4_invalid" integer,  -- Недействителни гласове
  "party5_id" integer,       -- № П/К/ИК
  "party5_valid" integer,    -- Действителни гласове
  "party5_invalid" integer,  -- Недействителни гласове
  "party6_id" integer,       -- № П/К/ИК
  "party6_valid" integer,    -- Действителни гласове
  "party6_invalid" integer,  -- Недействителни гласове
  "party7_id" integer,       -- № П/К/ИК
  "party7_valid" integer,    -- Действителни гласове
  "party7_invalid" integer,  -- Недействителни гласове
  "party8_id" integer,       -- № П/К/ИК
  "party8_valid" integer,    -- Действителни гласове
  "party8_invalid" integer,  -- Недействителни гласове
  "party9_id" integer,       -- № П/К/ИК
  "party9_valid" integer,    -- Действителни гласове
  "party9_invalid" integer,  -- Недействителни гласове
  "party10_id" integer,      -- № П/К/ИК
  "party10_valid" integer,   --- Действителни гласове
  "party10_invalid" integer, --  Недействителни гласове
  "party11_id" integer,      --  № П/К/ИК
  "party11_valid" integer,   --- Действителни гласове
  "party11_invalid" integer, --  Недействителни гласове
  "party12_id" integer,      --  № П/К/ИК
  "party12_valid" integer,   --- Действителни гласове
  "party12_invalid" integer, --  Недействителни гласове
  "party13_id" integer,      --  № П/К/ИК
  "party13_valid" integer,   --- Действителни гласове
  "party13_invalid" integer, --  Недействителни гласове
  "party14_id" integer,      --  № П/К/ИК
  "party14_valid" integer,   --- Действителни гласове
  "party14_invalid" integer, --  Недействителни гласове
  "party15_id" integer,      --  № П/К/ИК
  "party15_valid" integer,   --- Действителни гласове
  "party15_invalid" integer, --  Недействителни гласове
  "party16_id" integer,      --  № П/К/ИК
  "party16_valid" integer,   --- Действителни гласове
  "party16_invalid" integer, --  Недействителни гласове
  "party17_id" integer,      --  № П/К/ИК
  "party17_valid" integer,   --- Действителни гласове
  "party17_invalid" integer, --  Недействителни гласове
  "party18_id" integer,      --  № П/К/ИК
  "party18_valid" integer,   --- Действителни гласове
  "party18_invalid" integer, --  Недействителни гласове
  "party19_id" integer,      --  № П/К/ИК
  "party19_valid" integer,   --- Действителни гласове
  "party19_invalid" integer, --  Недействителни гласове
  "party20_id" integer,      --  № П/К/ИК
  "party20_valid" integer,   --- Действителни гласове
  "party20_invalid" integer, --  Недействителни гласове
  "party21_id" integer,      --  № П/К/ИК
  "party21_valid" integer,   --- Действителни гласове
  "party21_invalid" integer, --  Недействителни гласове
  "party22_id" integer,      --  № П/К/ИК
  "party22_valid" integer,   --- Действителни гласове
  "party22_invalid" integer  --  Недействителни гласове
);

