
create table _2019_european_candidates(
  "party_id" text,       -- 1) Номер на партия/коалиция/инициативен комитет
  "party_name" integer,  -- 2) Име на партия/коалиция/инициативен комитет
  "candidate_id" text,   -- 3) Номер на кандидат в листата
  "candidate_name" text, -- 4) Име на кандидат
  "chosen_one" text      -- 5) Флаг за избран кандидат
);

create table _2019_european_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име
);

create table _2019_european_preferences(
  "section_id" text,        -- 1) Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,       -- 2) Номер на партия
  "candidate_id" integer,   -- 3) Номер на кандидат в кандидатска листа
  "preferences" integer     -- 4) Брой предпочитания (преференции)
);

create table _2019_european_preferences_mv(
  "section_id" text,        -- 1) Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,       -- 2) Номер на партия
  "candidate_id" integer,   -- 3) Номер на кандидат в кандидатска листа
  "preferences" integer     -- 4) Брой предпочитания (преференции)
);

create table _2019_european_protocols(
  "form_number" integer,                -- 1) № формуляр
  "section_id" text,                    -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                -- 3) Формуляр № 1 - по приложение Приложение № 85-х      Идентификатор на административна единица, за която се отнася протокола  (община, кметство, район)
                                        --    Формуляр № 7 - по приложение Приложение № 86-ч:      Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
                                        --    Формуляр № 14 - по формат на данните от машините за гласуване:      Идентификатор на административна единица, за която се отнася протокола( Формуляр № 14 - по формат на данните от машините за гласуване:община, кметство, район)
                                        --    Формуляр № 8 - по Приложение № 85-хм:      Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,       -- 4) Серийни номера на страниците на протокола, разделени с |
  "ballots_available" integer,          ---  5) Формуляр № 1 - по приложение Приложение № 85-х А.   Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 от ИК
                                        --     Формуляр № 7 - по приложение Приложение № 86-ч: А.   Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 ИК
                                        --     Формуляр № 8 - по Приложение № 85-хм: А.   Брой на бюлетините, получени по реда на чл. 215, ал. 1 ИК
  "total_voters" integer,               --  6) Формуляр № 1 - по приложение Приложение № 85-х 1.   Брой на избирателите според част І и част ІІ на избирателния списък при предаването му на СИК
                                        --     Формуляр № 7 - по приложение Приложение № 86-ч: 1.   Брой на избирателите, вписани в списъка за гласуване извън страната при предаването му на СИК
                                        --     Формуляр № 8 - по Приложение № 85-хм: 1.   Брой на избирателите според част І и част ІІ на избирателния списък при предаването му на СИК
  "added_voters" integer,               --  7) Формуляр № 1 - по приложение Приложение № 85-х 2.   Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък (част І и част ІІ) в изборния ден
                                        --     Формуляр № 7 - по приложение Приложение № 86-ч: 2.   Брой на избирателите, вписани в списъка за гласуване извън страната в допълнителната страница в изборния ден (под чертата)
                                        --     Формуляр № 8 - по Приложение № 85-хм: 2.   Брой на избирателите, вписани в допълнителната страница на избирателния списък – част І и част ІІ (под чертата) Формуляр № 8 - по Приложение № 85-хм: в изборния ден
  "voters_by_signature" integer,        --  8) Формуляр № 1 - по приложение Приложение № 85-х 3.   Брой на гласувалите избиратели според положените подписи в избирателния списък (част І и част ІІ), включително и подписите в допълнителната страница/и (под чертата)
                                        --     Формуляр № 7 - по приложение Приложение № 86-ч: 3.   Брой на гласувалите избиратели според положените подписи в списъка за гласуване извън страната, включително и подписите в допълнителната страница/ и (под чертата)
                                        --     Формуляр № 8 - по Приложение № 85-хм: 3.   Брой на гласувалите избиратели според положените подписи в избирателния списък – част І и част ІІ, включително и подписите в допълнителната страница (под чертата)
  "boters_using_paper_ballot" integer,  --  9) Формуляр № 8 - по Приложение № 85-хм: 3.а) Формуляр № 8 - по Приложение № 85-хм: Брой избиратели, гласували с хартиена бюлетина
  "total_voters_by_machine" integer,    --  10) Формуляр № 14 - по формат на данните от машините за гласуване: -.   Общ брой гласували
                                        --      Формуляр № 8 - по Приложение № 85-хм: 3.б) Формуляр № 8 - по Приложение № 85-хм: Брой на потвърдените гласове от машинното гласуване
  "unused_ballots" integer,             --  11) Формуляр № 1 - по приложение Приложение № 85-х 4.а) брой на неизползваните бюлетини
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 4.а) брой на неизползваните бюлетини
                                        --      Формуляр № 8 - по Приложение № 85-хм: 4.а) Формуляр № 8 - по Приложение № 85-хм: брой на неизползваните бюлетини
  "destroyed_ballots" integer,          --  12) Формуляр № 1 - по приложение Приложение № 85-х 4.б) брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване)
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 4.б) брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване  от кочана и станали неизползваеми)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 4.б) Формуляр № 8 - по Приложение № 85-хм: брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer, --  13) Формуляр № 1 - по приложение Приложение № 85-х 4.в) брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 4.в) брой на недействителните бюлетини по чл. 265, ал. 5 ИК (когато номерът  на бюлетината не съответства на номер в кочана)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 4.в) Формуляр № 8 - по Приложение № 85-хм: брой на недействителните бюлетини по чл. 265, ал. 5 ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,      --  14) Формуляр № 1 - по приложение Приложение № 85-х 4.г) брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 4.г) брой на недействителните бюлетини по чл. 227 ИК (при които е използвана  възпроизвеждаща техника)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 4.г) Формуляр № 8 - по Приложение № 85-хм: брой на недействителните бюлетини по чл. 227 ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,     --  15) Формуляр № 1 - по приложение Приложение № 85-х 4.д) брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 4.д) брой на недействителните бюлетини по чл. 228 ИК (показан публично вот след гласуване)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 4.д) Формуляр № 8 - по Приложение № 85-хм: брой на недействителните бюлетини по чл. 228 ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,    --  16) Формуляр № 1 - по приложение Приложение № 85-х 4.е) брой на сгрешените бюлетини
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 4.е) брой на сгрешените бюлетини
                                        --      Формуляр № 8 - по Приложение № 85-хм: 4.е) Формуляр № 8 - по Приложение № 85-хм: брой на сгрешените бюлетини
  "ballots_in_box" integer,             --  17) Формуляр № 1 - по приложение Приложение № 85-х 5.   Брой на намерените в избирателната кутия бюлетини
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 5.   Брой на намерените в избирателната кутия бюлетини
                                        --      Формуляр № 8 - по Приложение № 85-хм: 5.   Общ брой на намерените в избирателната кутия бюлетини и потвърдените гласове от машинното гласуване
  "machine_ballots_in_box" integer,     --  18) Формуляр № 8 - по Приложение № 85-хм: 5.а) Брой на намерените в избирателната кутия бюлетини
  "confirmed_votes_by_machine" integer, --  19) -.   Брой на потвърдените гласове от машинното гласуване
  "invalid_ballots_in_box" integer,     --  20) Формуляр № 1 - по приложение Приложение № 85-х 6.   Брой намерени в избирателната кутия недействителни гласове (бюлетини)
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 6.   Брой намерени в избирателната кутия недействителни гласове (бюлетини)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 6.   Брой намерени в избирателната кутия недействителни гласове (бюлетини) Формуляр № 8 - по Приложение № 85-хм:
  "valid_ballots_in_box" integer,       --  21) Формуляр № 1 - по приложение Приложение № 85-х 7.   Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 7.   Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 7.   Общ брой на действителни гласове (брой намерени в избирателната кутия действителни бюлетини и действителни гласове от машинното гласуване) (Б + МГ)
  "valid_ballots_in_box_p_c" integer,   --  22) Формуляр № 1 - по приложение Приложение № 85-х 7.1  брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 7.1. брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети
                                        --      Формуляр № 8 - по Приложение № 85-хм: 7.1. брой на действителните гласове, подадени за кандидатите на партии, коалиции и инициативни комитети (Б+МГ)
  "valid_ballots_in_box_b" integer,     --  23) Формуляр № 8 - по Приложение № 85-хм: 7.1а брой на намерените в избирателната кутия действителни гласове (бюлетини), подадени за кандидатските листи на партии, коалиции и инициативни комитети (Б)
  "valid_ballots_in_box_mg" integer,    --  24) Формуляр № 14 - по формат на данните от машините за гласуване: -.   Брой действителните гласове, подадени за кандидатските листи на партии, Формуляр № 14 - по формат на данните от машините за гласуване: коалиции и инициативни комитети от машинното гласуване (МГ)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 7.1б брой действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети от машинното гласуване (МГ)
  "valid_no_one_all" integer,           --  25) Формуляр № 1 - по приложение Приложение № 85-х 7.2  брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 7.2. брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
                                        --      Формуляр № 8 - по Приложение № 85-хм: 7.2. брой действителни гласове (отбелязвания) Формуляр № 8 - по Приложение № 85-хм: само в квадратчето „Не подкрепям никого“ (Б+МГ)
  "valid_no_one_all_b" integer,         --  26) Формуляр № 8 - по Приложение № 85-хм: 7.2а брой на намерените в избирателната кутия действителни гласове (бюлетини) с отбелязване „Не подкрепям никого“ (Б)
  "valid_no_one_all_mg" integer,        --  27) Формуляр № 14 - по формат на данните от машините за гласуване: -.   Брой действителните гласове с отбелязване „Не подкрепям никого“ от машинното гласуване (МГ)
                                        --      Формуляр № 8 - по Приложение № 85-хм: 7.2б брой действителните гласове с отбелязване „Не подкрепям никого“ от машинното гласуване (МГ)
  "invalid_empty_or_onclear" integer    --  28) Формуляр № 1 - по приложение Приложение № 85-х 9.   Бюлетини, в които не е отбелязан вотът на избирателя (празни бюлетини), бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
                                        --      Формуляр № 7 - по приложение Приложение № 86-ч: 9.   Бюлетини, в които не е отбелязан вотът на избирателя (празни бюлетини), бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
                                        --      Формуляр № 8 - по Приложение № 85-хм: 9.   Бюлетини, в които не е отбелязан вотът на избирателя (празни бюлетини), бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
);

create table _2019_european_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" integer,            -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean,      -- 7) Флаг корабна секция
  "machine_voting" boolean     -- 8) Флаг машинно гласуване
);

create table _2019_european_votes(
  "section_id" text,         -- 1) Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
  "district_id" integer,     -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,       -- № П/К/ИК
  "party1_valid" integer,    -- Действителни гласове
  "party1_invalid" integer,  -- Недействителни гласове
  "party2_id" integer,       -- № П/К/ИК
  "party2_valid" integer,    -- Действителни гласове
  "party2_invalid" integer,  -- Недействителни гласове
  "party3_id" integer,       -- № П/К/ИК
  "party3_valid" integer,    -- Действителни гласове
  "party3_invalid" integer,  -- Недействителни гласове
  "party4_id" integer,       -- № П/К/ИК
  "party4_valid" integer,    -- Действителни гласове
  "party4_invalid" integer,  -- Недействителни гласове
  "party5_id" integer,       -- № П/К/ИК
  "party5_valid" integer,    -- Действителни гласове
  "party5_invalid" integer,  -- Недействителни гласове
  "party6_id" integer,       -- № П/К/ИК
  "party6_valid" integer,    -- Действителни гласове
  "party6_invalid" integer,  -- Недействителни гласове
  "party7_id" integer,       -- № П/К/ИК
  "party7_valid" integer,    -- Действителни гласове
  "party7_invalid" integer,  -- Недействителни гласове
  "party8_id" integer,       -- № П/К/ИК
  "party8_valid" integer,    -- Действителни гласове
  "party8_invalid" integer,  -- Недействителни гласове
  "party9_id" integer,       -- № П/К/ИК
  "party9_valid" integer,    -- Действителни гласове
  "party9_invalid" integer,  -- Недействителни гласове
  "party10_id" integer,      -- № П/К/ИК
  "party10_valid" integer,   -- Действителни гласове
  "party10_invalid" integer, --  Недействителни гласове
  "party11_id" integer,      --  № П/К/ИК
  "party11_valid" integer,   -- Действителни гласове
  "party11_invalid" integer, --  Недействителни гласове
  "party12_id" integer,      --  № П/К/ИК
  "party12_valid" integer,   -- Действителни гласове
  "party12_invalid" integer, --  Недействителни гласове
  "party13_id" integer,      --  № П/К/ИК
  "party13_valid" integer,   -- Действителни гласове
  "party13_invalid" integer, --  Недействителни гласове
  "party14_id" integer,      --  № П/К/ИК
  "party14_valid" integer,   -- Действителни гласове
  "party14_invalid" integer, --  Недействителни гласове
  "party15_id" integer,      --  № П/К/ИК
  "party15_valid" integer,   -- Действителни гласове
  "party15_invalid" integer, --  Недействителни гласове
  "party16_id" integer,      --  № П/К/ИК
  "party16_valid" integer,   -- Действителни гласове
  "party16_invalid" integer, --  Недействителни гласове
  "party17_id" integer,      --  № П/К/ИК
  "party17_valid" integer,   -- Действителни гласове
  "party17_invalid" integer, --  Недействителни гласове
  "party18_id" integer,      --  № П/К/ИК
  "party18_valid" integer,   -- Действителни гласове
  "party18_invalid" integer, --  Недействителни гласове
  "party19_id" integer,      --  № П/К/ИК
  "party19_valid" integer,   -- Действителни гласове
  "party19_invalid" integer, --  Недействителни гласове
  "party20_id" integer,      --  № П/К/ИК
  "party20_valid" integer,   -- Действителни гласове
  "party20_invalid" integer, --  Недействителни гласове
  "party21_id" integer,      --  № П/К/ИК
  "party21_valid" integer,   -- Действителни гласове
  "party21_invalid" integer, --  Недействителни гласове
  "party22_id" integer,      --  № П/К/ИК
  "party22_valid" integer,   -- Действителни гласове
  "party22_invalid" integer, --  Недействителни гласове
  "party23_id" integer,      --  № П/К/ИК
  "party23_valid" integer,   -- Действителни гласове
  "party23_invalid" integer, --  Недействителни гласове
  "party24_id" integer,      --  № П/К/ИК
  "party24_valid" integer,   -- Действителни гласове
  "party24_invalid" integer, --  Недействителни гласове
  "party25_id" integer,      --  № П/К/ИК
  "party25_valid" integer,   -- Действителни гласове
  "party25_invalid" integer, --  Недействителни гласове
  "party26_id" integer,      --  № П/К/ИК
  "party26_valid" integer,   -- Действителни гласове
  "party26_invalid" integer, --  Недействителни гласове
  "party27_id" integer,      --  № П/К/ИК
  "party27_valid" integer,   -- Действителни гласове
  "party27_invalid" integer  --  Недействителни гласове
);

create table _2019_european_votes_mv(
  "section_id" text,         -- 1) Пълен код на секция (код на район(2), община(2), адм. район(2), секция(3))
  "district_id" integer,     -- 2) Идентификатор на административна единица, за която се отнася протокола (община, кметство, район)
  "party1_id" integer,       -- № П/К/ИК
  "party1_valid" integer,    -- Действителни гласове
  "party1_invalid" integer,  -- Недействителни гласове
  "party2_id" integer,       -- № П/К/ИК
  "party2_valid" integer,    -- Действителни гласове
  "party2_invalid" integer,  -- Недействителни гласове
  "party3_id" integer,       -- № П/К/ИК
  "party3_valid" integer,    -- Действителни гласове
  "party3_invalid" integer,  -- Недействителни гласове
  "party4_id" integer,       -- № П/К/ИК
  "party4_valid" integer,    -- Действителни гласове
  "party4_invalid" integer,  -- Недействителни гласове
  "party5_id" integer,       -- № П/К/ИК
  "party5_valid" integer,    -- Действителни гласове
  "party5_invalid" integer,  -- Недействителни гласове
  "party6_id" integer,       -- № П/К/ИК
  "party6_valid" integer,    -- Действителни гласове
  "party6_invalid" integer,  -- Недействителни гласове
  "party7_id" integer,       -- № П/К/ИК
  "party7_valid" integer,    -- Действителни гласове
  "party7_invalid" integer,  -- Недействителни гласове
  "party8_id" integer,       -- № П/К/ИК
  "party8_valid" integer,    -- Действителни гласове
  "party8_invalid" integer,  -- Недействителни гласове
  "party9_id" integer,       -- № П/К/ИК
  "party9_valid" integer,    -- Действителни гласове
  "party9_invalid" integer,  -- Недействителни гласове
  "party10_id" integer,      -- № П/К/ИК
  "party10_valid" integer,   -- Действителни гласове
  "party10_invalid" integer, --  Недействителни гласове
  "party11_id" integer,      --  № П/К/ИК
  "party11_valid" integer,   -- Действителни гласове
  "party11_invalid" integer, --  Недействителни гласове
  "party12_id" integer,      --  № П/К/ИК
  "party12_valid" integer,   -- Действителни гласове
  "party12_invalid" integer, --  Недействителни гласове
  "party13_id" integer,      --  № П/К/ИК
  "party13_valid" integer,   -- Действителни гласове
  "party13_invalid" integer, --  Недействителни гласове
  "party14_id" integer,      --  № П/К/ИК
  "party14_valid" integer,   -- Действителни гласове
  "party14_invalid" integer, --  Недействителни гласове
  "party15_id" integer,      --  № П/К/ИК
  "party15_valid" integer,   -- Действителни гласове
  "party15_invalid" integer, --  Недействителни гласове
  "party16_id" integer,      --  № П/К/ИК
  "party16_valid" integer,   -- Действителни гласове
  "party16_invalid" integer, --  Недействителни гласове
  "party17_id" integer,      --  № П/К/ИК
  "party17_valid" integer,   -- Действителни гласове
  "party17_invalid" integer, --  Недействителни гласове
  "party18_id" integer,      --  № П/К/ИК
  "party18_valid" integer,   -- Действителни гласове
  "party18_invalid" integer, --  Недействителни гласове
  "party19_id" integer,      --  № П/К/ИК
  "party19_valid" integer,   -- Действителни гласове
  "party19_invalid" integer, --  Недействителни гласове
  "party20_id" integer,      --  № П/К/ИК
  "party20_valid" integer,   -- Действителни гласове
  "party20_invalid" integer, --  Недействителни гласове
  "party21_id" integer,      --  № П/К/ИК
  "party21_valid" integer,   -- Действителни гласове
  "party21_invalid" integer, --  Недействителни гласове
  "party22_id" integer,      --  № П/К/ИК
  "party22_valid" integer,   -- Действителни гласове
  "party22_invalid" integer, --  Недействителни гласове
  "party23_id" integer,      --  № П/К/ИК
  "party23_valid" integer,   -- Действителни гласове
  "party23_invalid" integer, --  Недействителни гласове
  "party24_id" integer,      --  № П/К/ИК
  "party24_valid" integer,   -- Действителни гласове
  "party24_invalid" integer, --  Недействителни гласове
  "party25_id" integer,      --  № П/К/ИК
  "party25_valid" integer,   -- Действителни гласове
  "party25_invalid" integer, --  Недействителни гласове
  "party26_id" integer,      --  № П/К/ИК
  "party26_valid" integer,   -- Действителни гласове
  "party26_invalid" integer, --  Недействителни гласове
  "party27_id" integer,      --  № П/К/ИК
  "party27_valid" integer,   -- Действителни гласове
  "party27_invalid" integer  --  Недействителни гласове
);
