
CREATE TABLE _2017_parliament_cik_parties(
  "party_id" integer, -- 1) Номер
  "party_name" text   -- 2) Име  
);

CREATE TABLE _2017_parliament_local_candidates(
  "region_id" integer,    -- 1) Код на РИК
  "region_name" text,     -- 2) Наименование на Район
  "party_id" integer,     -- 3) Номер на партия/коалиция/инициативен комитет
  "party_name" text,      -- 4) Име на партия/коалиция/инициативен комитет
  "candidate_id" integer, -- 5) Номер на кандидат в листата
  "candidate_name" text,  -- 6) Име на кандидат
  "" text
);

CREATE TABLE _2017_parliament_local_parties(
  "id" integer,       -- 1) Код на РИК
  "region" text,      -- 2) Наименование на Район
  "party_id" integer, -- 3) Номер на партия
  "party_name" text   -- 4) Име
);

CREATE TABLE _2017_parliament_preferences(
  "section_id" text,        -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "party_id" integer,       -- 2) Номер на партия
  "valid_ballots" integer,  -- 3) Номер на кандидат в кандидатска листа
  "invalid_ballots" integer -- 4) Брой гласове
);

CREATE TABLE _2017_parliament_protocols(
  "form_number" integer,                -- 1) № формуляр
  "section_id" text,                    -- 2) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "district_id" integer,                -- 3) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "protocol_serial_numbers" text,       -- 4) Серийни номера на страниците на протокола, разделени с |
  "ballots_available" integer,          -- 5)  Формуляр № 1: А.Брой на бюлетините, получени по реда на чл. 215, ал. 1, т. 2 от ИК
                                        --     Формуляр № 7: А.Брой на бюлетините, получени по реда на чл. 215, ал. 1 от ИК
  "total_voters" integer,               -- 6)  Формуляр № 1: 1.Брой на избирателите според избирателния списък при предаването му на СИК
                                        --     Формуляр № 7: 1.Брой избиратели според списъка за гласуване извън страната преди предаването му на СИК
  "added_voters" integer,               -- 7)  Формуляр № 1: 2.Брой на избирателите, вписани в допълнителната страница (под чертата) на избирателния списък в изборния ден
                                        --     Формуляр № 7: 2.Брой на избирателите, вписани в избирателния списък в изборния ден (под чертата)
  "voters_by_signature" integer,        -- 8)  Формуляр № 1: 3.Брой на гласувалите избиратели според положените подписи в избирателния списък, включително и подписите в допълнителната страница(под чертата)
                                        --     Формуляр № 7: 3.Брой на гласувалите избиратели според положените подписи в избирателния списък
  "unused_ballots" integer,             -- 9) Формуляр № 1: 4.а)брой на неизползваните бюлетини
                                        --    Формуляр № 7: 4.а)брой на неизползваните бюлетини
  "destroyed_ballots" integer,          -- 10)4.б)брой на унищожените от СИК бюлетини по други поводи (за създаване на образци за таблата пред изборното помещение и увредени механично при откъсване от кочана и станали неизползваеми)
  "invalid_ballots_invalid_sn" integer, -- 11) Формуляр № 1: 4.в)брой на недействителните бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
                                        --     Формуляр № 7: 4.в)бюлетини по чл. 265, ал. 5 от ИК (когато номерът на бюлетината не съответства на номер в кочана)
  "invalid_ballots_photo" integer,      -- 12)4.г)брой на недействителните бюлетини по чл. 227 от ИК (при които е използвана възпроизвеждаща техника)
  "invalid_ballots_public" integer,     -- 13)4.д)брой на недействителните бюлетини по чл. 228 от ИК (показан публично вот след гласуване)
  "invalid_ballots_mistake" integer,    -- 14)4.е)брой на сгрешените бюлетини по чл. 267, ал. 2 от ИК
  "ballots_in_box" integer,             -- 15)  5.Брой на намерените в избирателната кутия бюлетини
  "invalid_ballots_in_box" integer,     -- 16)  6.Брой намерени в избирателната кутия недействителни гласове (бюлетини)
  "valid_ballots_in_box" integer,       -- 17) Формуляр № 1: 7.Общ брой намерени в избирателната кутия действителни гласове (бюлетини)
                                        --     Формуляр № 7: 7.Общ брой намерени в избирателната кутия действителните гласове (бюлетини)
  "valid_ballots_for_party" integer,    -- 18) Формуляр № 1: 7.1брой на действителните гласове, подадени за кандидатските листи на партии, коалиции и инициативни комитети 
                                        --     Формуляр № 7: 7.1брой на действителните гласове, подадени за кандидатски листи на партии и коалиции
  "valid_no_one_all" integer,           -- 19) 7.2брой действителни гласове (отбелязвания) само в квадратчето „Не подкрепям никого“
  "invalid_empty_or_onclear" integer   -- 20)  9.Празни бюлетини; бюлетини, в които е гласувано в повече от едно квадратче; бюлетини, в които не може да се установи еднозначно вотът на избирателя и други видове недействителни гласове
);

CREATE TABLE _2017_parliament_sections(
  "section_id" text,           -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3))
  "section_local_id" integer,  -- 2) Идентификатор на административна единица, за която се гласува в секцията
  "district_name" text,        -- 3) Име на административна единица, за която се гласува в секцията
  "ekatte" integer,            -- 4) ЕКАТТЕ на населеното място
  "location_name" text,        -- 5) Име на Населено място, където е регистрирана секцията (за секциите извън страната - Държава, Населено място)
  "mobile_section" boolean,    -- 6) Флаг мобилна секция
  "ship_section" boolean       -- 7) Флаг корабна секция
);

CREATE TABLE _2017_parliament_votes(
  "section_id" text,         -- 1) Пълен код на секция(код на район(2), община(2), адм. район(2), секция(3));
  "region_id" integer,       -- 2) Идентификатор на административна единица, за която се отнася протокола(община, кметство, район)
  "party1_id" integer,       -- № П/К/ИК
  "party1_valid" integer,    -- Действителни гласове
  "party1_invalid" integer,  -- Недействителни гласове
  "party2_id" integer,       -- № П/К/ИК
  "party2_valid" integer,    -- Действителни гласове
  "party2_invalid" integer,  -- Недействителни гласове
  "party3_id" integer,       -- № П/К/ИК
  "party3_valid" integer,    -- Действителни гласове
  "party3_invalid" integer,  -- Недействителни гласове
  "party4_id" integer,       -- № П/К/ИК
  "party4_valid" integer,    -- Действителни гласове
  "party4_invalid" integer,  -- Недействителни гласове
  "party5_id" integer,       -- № П/К/ИК
  "party5_valid" integer,    -- Действителни гласове
  "party5_invalid" integer,  -- Недействителни гласове
  "party6_id" integer,       -- № П/К/ИК
  "party6_valid" integer,    -- Действителни гласове
  "party6_invalid" integer,  -- Недействителни гласове
  "party7_id" integer,       -- № П/К/ИК
  "party7_valid" integer,    -- Действителни гласове
  "party7_invalid" integer,  -- Недействителни гласове
  "party8_id" integer,       -- № П/К/ИК
  "party8_valid" integer,    -- Действителни гласове
  "party8_invalid" integer,  -- Недействителни гласове
  "party9_id" integer,       -- № П/К/ИК
  "party9_valid" integer,    -- Действителни гласове
  "party9_invalid" integer,  -- Недействителни гласове
  "party10_id" integer,      -- № П/К/ИК
  "party10_valid" integer,   -- Действителни гласове
  "party10_invalid" integer, --  Недействителни гласове
  "party11_id" integer,      --  № П/К/ИК
  "party11_valid" integer,   -- Действителни гласове
  "party11_invalid" integer, --  Недействителни гласове
  "party12_id" integer,      --  № П/К/ИК
  "party12_valid" integer,   -- Действителни гласове
  "party12_invalid" integer, --  Недействителни гласове
  "party13_id" integer,      --  № П/К/ИК
  "party13_valid" integer,   -- Действителни гласове
  "party13_invalid" integer, --  Недействителни гласове
  "party14_id" integer,      --  № П/К/ИК
  "party14_valid" integer,   -- Действителни гласове
  "party14_invalid" integer, --  Недействителни гласове
  "party15_id" integer,      --  № П/К/ИК
  "party15_valid" integer,   -- Действителни гласове
  "party15_invalid" integer, --  Недействителни гласове
  "party16_id" integer,      --  № П/К/ИК
  "party16_valid" integer,   -- Действителни гласове
  "party16_invalid" integer, --  Недействителни гласове
  "party17_id" integer,      --  № П/К/ИК
  "party17_valid" integer,   -- Действителни гласове
  "party17_invalid" integer, --  Недействителни гласове
  "party18_id" integer,      --  № П/К/ИК
  "party18_valid" integer,   -- Действителни гласове
  "party18_invalid" integer, --  Недействителни гласове
  "party19_id" integer,      --  № П/К/ИК
  "party19_valid" integer,   -- Действителни гласове
  "party19_invalid" integer, --  Недействителни гласове
  "party20_id" integer,      --  № П/К/ИК
  "party20_valid" integer,   -- Действителни гласове
  "party20_invalid" integer, --  Недействителни гласове
  "party21_id" integer,      --  № П/К/ИК
  "party21_valid" integer,   -- Действителни гласове
  "party21_invalid" integer, --  Недействителни гласове
  "party22_id" integer,      --  № П/К/ИК
  "party22_valid" integer,   -- Действителни гласове
  "party22_invalid" integer, --  Недействителни гласове
  "party23_id" integer,      --  № П/К/ИК
  "party23_valid" integer,   -- Действителни гласове
  "party23_invalid" integer  --  Недействителни гласове
);